{
      "data": [
          {
            "id": "324c3b9a-d073-4459-9f98-292cb8e50186",
            "distance": "1",
            "url": "https://jobs.github.com/positions/324c3b9a-d073-4459-9f98-292cb8e50186",
            "created_at": "Fri Mar 06 20:09:30 UTC 2020",
            "company": "UPPAbaby",
            "company_url": "https://uppababy.com",
            "location": "Kilifi",
            "jobtitle": "Sales Executive",
            "description": " We are looking for an experienced back-end developer to take ownership over the back-end of our website and present creative solutions to established objectives as well as take a proactive approach to enhancing user experience. UPPAbaby is about to embark on a complete redesign of our front and back end code, so you would have a high level of creative, technical, and structural influence in that project. This is great opportunity for someone looking to get involved and take ownership of a redesign from the ground up.    This is a full-time position and your focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your coworkers into the application. A basic understanding of front-end technologies is therefore necessary as well.    The ideal candidate will have the abilities to manage the technical workload along with effectively communicating in a flexible, team-based environment. You will work closely with the front-end developer, designers, and external development teams on building, modifying, updating, and maintaining current and new systems.      RESPONSIBILITIES      -Collaborating with the front-end developers, other team members, and external teams to establish objectives and design more functional, cohesive codes to enhance the user experience    -Building reusable code and libraries for future use    -Optimization of the application for maximum speed and scalability    -Implementation of security and data protection    -Design and implementation of data storage solutions    -Engineer and utilize APIs and other up-to-date technologies to interact with other systems &amp; applications    -Build user-centric solutions with an emphasis on best practices and WCAG accessibility requirements    -Taking lead on projects, as needed    -Developing ideas for new programs, products, or features by monitoring industry developments and trends      REQUIRED SKILLS AND EXPERIENCE      -5+ years of direct experience    -Strong problem solving, critical thinking, writing and communication skills    -Self-starter with ability to work independently in a fast moving, quickly changing environment    -Understanding accessibility and security compliance    -User authentication and authorization between multiple systems, servers, and environments    -Integration of multiple data sources and databases into one system    -Management of hosting environment, including database administration and scaling an application to support load changes    -Data migration, transformation, and scripting    -Setup and administration of backups    -Outputting data in different formats    -Understanding differences between multiple delivery platforms such as mobile vs desktop, and optimizing output to match the specific platform    -Creating database schemas that represent and support business processes    -Implementing automated testing platforms and unit tests    -Must have advanced understanding of WordPress and related technologies    -Proficient knowledge of the following back-end programming languages:    -MySQL, AJAX, PHP, Java, JavaScript, jQuery (required)    -React or related Javascript framework (highly preferred)    -Ruby (a plus)    -Experience with back-end frameworks and CMS environments    -Understanding of responsive front-end frameworks and development    -Proficient understanding of code versioning tools, such as Git    -Proficient understanding of OWASP security principles    -Understanding of “session management” in a distributed server environment    -Must be able to be onsite 2-3 days a week, subject to change as position evolves      STRONGLY PREFERRED EXPERIENCE      -Familiarity and ability to work with the following:    -WooCommerce    -WordPress    -NetSuite    -Basic understanding of front-end technologies and platforms, such as JavaScript, HTML5, and CSS3    -Good understanding of server-side CSS preprocessors, such as LESS and SASS    -Native application development    -Basic understanding of SEO principles      ABOUT UPPABABY      Based in Rockland, Mass., UPPAbaby is on a mission to make the smartest strollers, car seats and juvenile gear available: intuitively designed, stylish and sleek, with the features and functions new parents want—plus innovations they never knew were possible.    Our company is laid back, with a collaborative culture and a variety of benefits, including:    Competitive salary    Health, dental and vision insurance    401K and life insurance    No dress code    Flexible hours    Weekly catered lunches    Free snacks, drinks and cold brew on tap    In-house gym   ",
            "how_to_apply": " <a href=\"https://uppababy.distanceform.com/to/OJIdvz\">https://uppababy.distanceform.com/to/OJIdvz</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fae31e23baf01dea30a08ce322586f67ca72b76c/Logo.png"
        },
        {
            "id": "cfa24f3f-f31f-4186-a499-b46d5cdd7912",
            "distance": "2",
            "url": "https://jobs.github.com/positions/cfa24f3f-f31f-4186-a499-b46d5cdd7912",
            "created_at": "Fri Mar 06 18:16:50 UTC 2020",
            "company": "Science-Inc",
            "company_url": "https://www.science-inc.com/",
            "location": "Garissa",
            "jobtitle": "Software Engineer",
            "description": " Responsibilities    -Plan and implement creative gameplay content and experiences using Roblox Studio and Lua    -Understand and extend existing frameworks and systems to support the features necessary for your creative updates    Requirements    -Designed &amp; programmed at least 1 top quality experience/game on Roblox - please provide link    -Passion for conceptualizing and implementing your own creative and original ideas    -Strong grasp of Roblox API    -Solid familiarity with data structures (stacks, queues, graphs, hashmaps, etc) and algorithms (BFS, DFS, Quicksort, etc)    -Strong communication skills in English    Bonus Qualifications    -Experience working in self-managed roles and Nakuru teams    -Secondary game development skills that may help you support your engineering work - UI/UX, game design, graphic design, audio design, modeling + texturing, etc   ",
            "how_to_apply": " Please apply to the position via the following link: <a href=\"https://springrecruit.com/applyNow/Science5787\">https://springrecruit.com/applyNow/Science5787</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGVBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d1648adfca87cedaac902ad34b3c3bc091a7fdac/Science-on-white-final.jpg"
        },
        {
            "id": "2ca1f0fa-b6ef-4710-9506-0965ce092b99",
            "distance": "3",
            "url": "https://jobs.github.com/positions/2ca1f0fa-b6ef-4710-9506-0965ce092b99",
            "created_at": "Fri Mar 06 15:38:26 UTC 2020",
            "company": "DCMN GmbH",
            "company_url": "https://www.dcmn.com/",
            "location": "Kakamega",
            "jobtitle": "Senior Backend Developer (m/f/d)",
            "description": " Are you a curious innovator? A passionate problem solver? Born digital? And maybe a little wild at heart? If so, read on.      We’re DCMN   – the growth marketing partner for digital businesses and startups. Our holistic, data-driven approach combines technology with expert knowledge to grow the market leaders of tomorrow. Our vision is bold: we want everyone in the world to use one of our client’s services. If you have the drive to get us there, let’s talk.      What you'll be working on:            You are designing, developing, deploying, operating &amp; improving our tracking and analysis technology for TV campaigns.          You take ownership for the whole development cycle, from architecture design to testing to implementation &amp; maintenance.          You and your team own your code, and decide on technologies and tools as well. You operate on distributed data processing architectures.            We believe that the following will help you succeed in this role:            You are proficient in a functional and at least one other programming language - we heavily use Scala and PHP.          You have a deep understanding of RDBMS as well as NoSQL solutions.          You have experience in building distributed data processing architectures.          You have experience with AWS cloud services and stream-processing systems.          You bring with you a passion for simple, pragmatic, and robust system design.          You write clean, modular and testable code accompanied with proper, meaningful tests.          You have gained experience in operating and monitoring production environments.            What you can expect from us:            An awesome office space in the heart of Kakamega full of radically supportive colleagues and the opportunity for an exceptional career within a disruptive company.          Support for your personal and professional growth - you choose what accelerates your learning and adds value for you and DCMN.          Flexibility to manage your own hours and work from home when you need to.          Work equipment that’s available for your personal use, free snacks and drinks, and regular team lunches &amp; events.          A truly multicultural work environment - we currently have employees from 30+ countries around the world!          We will give you the chance to take ownership of your work and learn from experienced and successful professionals in the field. Our flat hierarchy is built on trust and collaboration.         ",
            "how_to_apply": " Please submit your application <a href=\"https://app.jobvite.com/j?aj=oxUocfwL&amp;s=GitHub\">here</a> !   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--21496aaa9f9d4003e3df6fd701a7b2171f54593f/DCMN_logo.jpeg"
        },
        {
            "id": "ddf6da2a-1f3d-4119-b6d2-6fa29996f29b",
            "distance": "4",
            "url": "https://jobs.github.com/positions/ddf6da2a-1f3d-4119-b6d2-6fa29996f29b",
            "created_at": "Fri Mar 06 13:02:25 UTC 2020",
            "company": "Coöperatie DELA",
            "company_url": "http://www.dela.nl",
            "location": "Nairobi",
            "jobtitle": "Azure Integratie Developer (32-40 uur, Nairobi)",
            "description": " Azure Integratie Developer (32-40 uur, Nairobi)    Binnen een Agile-team ben jij de expert op het gebied van integratie en koppel je systemen aan elkaar om onze klanten op de juiste manier van informatie te voorzien. Hierbij ondersteun je de collega’s met het veilig en snel ontsluiten en integreren van databronnen, processen, applicaties en apparaten. Het is jouw taak om alle gewenste systeemintegraties te realiseren en te onderhouden. Je bent bereid om bij te springen met andere werkzaamheden als de situatie daarom vraagt. Je bent goed in je werk, je houdt van verandering, je kijkt altijd verder dan je neus lang is en je vindt het fantastisch om iets nieuws op te pakken, uit te zoeken, te innoveren, een nieuwe weg in te slaan!    Informatietechnologie speelt een belangrijke rol in het waarmaken van de strategie van Coöperatie DELA. Met onze professionele ondersteuning willen wij voor onze collega's een vertrouwd IT-partner zijn. Wendbaarheid, transparantie en voorspelbaarheid zijn cruciaal voor de kwaliteit van onze dienstverlening.    IT is geen geïsoleerde afdeling binnen DELA. Om onze strategische doelen te kunnen realiseren werken we nauw samen met collega’s uit verschillende delen van de organisatie. Dit doen we in DevOps-teams waarin naast Developers, Testers en Analisten ook vaak andere functies deelnemen.    Als Azure Integratie Developer kun je echt jouw vakmanschap laten zien en werk je binnen een team aan uitdagende vraagstukken. Je ontwerpt en realiseert de juiste oplossingen. Als professional draag je bij aan de optimale klantervaring van de leden van DELA.    Jouw functie in het kort:    Binnen het scrumteam vervul jij de rol als Integratie Developer. Waar staan we? Wie is bezig met welke userstory? En waar ga jij met jouw kennis het verschil maken? Je denkt mee over best practices en hebt een strategische visie op development en onze applicaties. Je deelt je kennis en waarborgt de kwaliteit van de software. Verder:        Verzorg je het technisch ontwerp en bouw je API’s en services in de keten;     Maak je een vertaalslag vanuit de domein- en solutionarchitectuur naar goede oplossingen;     Ontwikkel en bouw je API’s/Services die voldoen aan de design patterns;     Pak je de user stories op, van architectuur tot integratietesten en werk je hierbij nauw samen met je teamgenoten.       Wie ben jij?    Jij bent een Azure Integratie Developer met oog voor techniek, details én mensen. Daarnaast ben je iemand die elke dag nieuwe dingen wil leren en uitproberen. Met jouw lef, hoge energieniveau en positieve instelling zet je elke dag die extra stap. Je zoekt een plek om jouw ambities waar te maken en waar jouw creativiteit verwelkomd wordt. Je bent een echte teamspeler met een sterke klant- en oplossingsgerichte instelling. Een aanwinst voor je eigen team, voor de IT-afdeling en ook DELA. Verder heb je:        HBO/WO werk- en denkniveau (geen diploma vereist) en enkele jaren werkzaam als (senior) engineer of developer;     Ervaring met Azure Integration Services (Azure Service Bus, Event hub, Event grid, Functions, Logic apps, APIM);     Ervaring met .NET Framework, C# en Liquid;     Ervaring met DevOps, CI/CD, GIT;     Kennis van security- en Identify-aspecten (OAUTH, API-key);     Een constante drive om te leren en jezelf te ontwikkelen.       Wij bieden:        Een innovatieve omgeving met een open en informele cultuur waar ruimte is voor initiatief;     Je hebt de beschikking over een ruim opleidingsbudget en de vrijheid deze in te zetten door middel van gerichte opleidingen. Daarnaast heb je de mogelijkheid om vakinhoudelijke events te bezoeken. Kortom: je kunt bij ons veel leren en je wordt continu uitgedaagd het beste uit jezelf te halen;     Een zelfstandige rol met veel ruimte voor eigen inbreng binnen een organisatie met veel 'change' in plaats van 'run';     Je krijgt een uitstekend salaris dat afhankelijk is van je kennis en ervaring. Daarnaast bieden wij een 13e maand, variabele beloning, goed pensioen en kortingen op verzekeringen.       Solliciteren?    Wil je betekenisvol werk doen en spreekt de uitdaging je aan? Reageer dan direct via <a href=\"https://dela.redirect.your-jobresponse.com/azure_integratie_developer_32_40_uur_Nairobi_Nairobi/265261/V819/solliciteren\">deze link!</a>. Voor meer informatie kun je contact opnemen met Kristel van Reenen (Manager IT) via 06-30264124.    Acquisitie n.a.v. deze advertentie wordt niet op prijs gesteld.   ",
            "how_to_apply": " <a href=\"https://dela.redirect.your-jobresponse.com/azure_integratie_developer_32_40_uur_Nairobi_Nairobi/265261/V819/solliciteren\">Klik hier om te solliciteren!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8a9f6713085dd68ea5d68ec67e359c656616c7ab/Dela.gif"
        },
        {
            "id": "fb14e58d-4142-4e46-bef5-653dd142361c",
            "distance": "5",
            "url": "https://jobs.github.com/positions/fb14e58d-4142-4e46-bef5-653dd142361c",
            "created_at": "Fri Mar 06 12:49:56 UTC 2020",
            "company": "Coöperatie DELA",
            "company_url": "http://www.dela.nl",
            "location": "Nairobi",
            "jobtitle": "Sitecore Developer (32-40 uur) Nairobi",
            "description": " Binnen het scrumteam ben jij de expert op het gebied van Sitecore en werk je vooral mee aan gave, nieuwe functionaliteiten, bouwstenen en componenten voor de DELA-website. Daarnaast verbeter je bestaande functionaliteit. Je richt je daarbij vooral op Sitecore development en je bent bereid om bij te springen met andere werkzaamheden als de situatie daarom vraagt. Je bent goed in je werk, je houdt van verandering, je kijkt altijd verder dan je neus lang is en je vindt het fantastisch om iets nieuws op te pakken, uit te zoeken, te innoveren, een nieuwe weg in te slaan!    Informatietechnologie speelt een belangrijke rol in het waarmaken van de strategie van Coöperatie DELA. Met onze professionele ondersteuning willen wij voor onze collega's een vertrouwd IT-partner zijn. Wendbaarheid, transparantie en voorspelbaarheid zijn cruciaal voor de kwaliteit van onze dienstverlening.    IT is geen geïsoleerde afdeling binnen DELA. Om onze strategische doelen te kunnen realiseren werken we nauw samen met onze collega's in de rest van de organisatie. Dit doen we met agile teams waarin behalve Ontwikkelaars, Testers en Analisten ook vaak andere functies deelnemen.    Als Sitecore Developer kun je echt jouw vakmanschap laten zien en werk je binnen een scrumteam aan uitdagende vraagstukken. Verder ontwerp en realiseer je oplossingen die er voor zorgen dat de website beter onderhoudbaar, stabieler en consistenter wordt. Als professional draag je zo bij aan de optimale klantervaring van de leden van DELA!      Jouw functie in het kort:      Binnen het scrumteam vervul jij de rol als Sitecore Developer. Waar staan we? Wie is bezig met welke userstory? En waar ga jij met jouw kennis het verschil maken? Je denkt mee over best practices en hebt een strategische visie op development en onze applicaties. Je deelt kennis en waarborgt de kwaliteit van de software. Verder:        Ontwikkel je kleine schaalbare, modulaire en kwalitatief goede software die DELA helpt om een betere klantwaarde te realiseren;     Zorg je voor kwaliteitsoplossingen volgens de geldende architectuur en richtlijnen;     Ontwikkel je code die voldoet aan de design patterns, zodat software wordt gerealiseerd volgens best practices en kwaliteitsnormen;     En pak je user stories op en lever je oplossingen voor (interne) gebruikers/leden.         Wie ben jij?      Jij bent een Sitecore Developer met oog voor techniek, details én mensen. Daarnaast ben je iemand die elke dag nieuwe dingen wil leren en uitproberen. Met jouw lef, hoge energieniveau en positieve instelling zet je elke dag die extra stap. Je zoekt een plek om jouw ambities waar te maken waar creativiteit verwelkomd wordt. Een echte teamspeler met een klant- en oplossingsgerichte instelling. Een aanwinst voor je eigen team, voor de IT-afdeling en ook DELA. Verder heb je:        HBO/WO werk- en denkniveau (geen diploma vereist) en enkele jaren werkzaam als Engineer of Developer;     Ervaring met Sitecore of een ander CMS;     Ervaring met .NET Framework, C# en Visual Studio;     Kennis van andere technieken, zoals HTML, JSON, CSS, Javascript en frameworks hieromheen;     Kennis van security-aspecten en -ontwikkelingen;     Een constante drive om te leren en jezelf te ontwikkelen.         Wij bieden:          Een innovatieve omgeving met een open en informele cultuur waar ruimte is voor initiatief;     Je hebt de beschikking over een ruim opleidingsbudget en de vrijheid deze in te zetten door middel van gerichte opleidingen. Daarnaast heb je de mogelijkheid om vakinhoudelijke events te bezoeken. Kortom: je kunt bij ons veel leren en je wordt continu uitgedaagd het beste uit jezelf te halen;     Een zelfstandige rol met veel ruimte voor eigen inbreng binnen een organisatie met veel 'change' in plaats van 'run';     Een uitstekend salaris dat afhankelijk is van je kennis en ervaring. Daarnaast bieden wij een 13e maand, variabele beloning, goed pensioen en kortingen op verzekeringen.         Solliciteren?      Wil je betekenisvol werk doen en spreekt de uitdaging je aan? Reageer dan direct via <a href=\"https://dela.redirect.your-jobresponse.com/sitecore_developer_32_40_uur_Nairobi_Nairobi/265257/V819/solliciteren\">deze link</a>. Voor meer informatie kun je contact opnemen met Ans van den Boogaard (Manager IT) via 06-23028909.    Acquisitie n.a.v. deze advertentie wordt niet op prijs gesteld.   ",
            "how_to_apply": " <a href=\"https://dela.redirect.your-jobresponse.com/sitecore_developer_32_40_uur_Nairobi_Nairobi/265257/V819/solliciteren\">Klik hier om te solliciteren!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa21BIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2fc826e611cab2e2a0130595b481c3f707a0696e/companyLogo-DELA_Coop_payoff_oranje_blauw.gif"
        },
      {
            "id": "3aac1cd1-d9ff-4baf-b9f4-10822775bfa5",
            "distance": "6",
            "url": "https://jobs.github.com/positions/3aac1cd1-d9ff-4baf-b9f4-10822775bfa5",
            "created_at": "Thu Mar 05 23:48:43 UTC 2020",
            "company": "Be Grizzlee ",
            "company_url": "http://http",
            "location": "Nairobi",
            "jobtitle": "Senior Engineer",
            "description": " Job Description    About TDE Group TDE Group consists of two disciplines: Experience Design and Technology. Through these areas of expertise we augment and elevate agency and production teams with user first, technology driven work for our clients ranging from interactive advertising to web &amp; mobile applications.    The Role The Senior Engineer is a crucial part of our team. With your expertise, you will take ownership of building applications and products with great quality. You will guide and mentor engineers. You have expert skills in Javascript and love to build with new libraries and API’s.    In this role, you will:        mentor and coach engineers on technical aspects     lead knowledge-share sessions among the team     identify opportunities to improve workflows within the team and execute on a plan of strategy to address them     set up cloud infrastructure for a web application     build protodistances of creative and interactive ideas     build full stack Javascript applications     learn new web API’s and other technology     partner with user experience designers to create new interactive concepts       In a typical week, you will:        review and provide feedback on code written by other engineers on your team     ship code for a web application     maintain tools and applications     manage periodic review and maintenance of code quality for the team       You should have:        previous leadership or coaching experience within a professional environment     at least 5 years of Javascript development experience     a deep knowledge of at least one or two modern Javascript frameworks, React preferred     an understanding of responsive design and development     built and maintained applications in Node.js     written database schemas     built REST and/or GraphQL APIs       It would be awesome if you have:        experience with WebGL     an understanding of animation     worked with Arduino or Raspberry Pi     experience with Docker and/or Kubernetes     worked on a  project using distancescript     written tests using Jest or other testing libraries       About Be Grizzlee    Be Grizzlee, part of Omnicom Group Inc. (NASDAQ: OMC), is an always-on studio that hyper-tailors content for all its partners.  Through agile production and a disruptive core, our diverse talent delivers best-in-class experiences globally.  Our varied experience in, and our love of the media arts allows us to seamlessly integrate at a cost, quality, scale and speed that is unmatched.    Founded in 2019, Be Grizzlee is headquartered in Nairobiwith offices in London, Singapore, and Shanghai. As an employee of Be Grizzlee, you will be part of a global network that includes TBWA's portfolio of advertising agencies including TBWA Chiat Day and Media Arts Lab (MAL). Many employees are dedicated to one brand, but we all have the benefit of using each other’s strengths and insights.    We are an equal opportunity employer and value diversity at our company.    Benefits &amp; Perks        Unlimited paid vacation policy     Catered breakfast and lunch; snacks provided     Medical, dental, vision, FSA, life insurance plans     Tuition reimbursement program     401k with employer match     Dog-friendly office     Employer-sponsored iPhone and Apple Watch rebates     Company events and happy hours      ",
            "how_to_apply": " Email your resume to: <a href=\"mailto:danny.ho@begrizzlee.com\">danny.ho@begrizzlee.com</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2VBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--855b7989a6b5883243faf3bf94404524e3d91edd/Be%20Grizzlee%20logo_BW%20(1).JPG"
        },
        {
            "id": "445c41a5-c066-4db8-9c01-0e1c02ad9333",
            "distance": "7",
            "url": "https://jobs.github.com/positions/445c41a5-c066-4db8-9c01-0e1c02ad9333",
            "created_at": "Thu Mar 05 23:09:52 UTC 2020",
            "company": "Publicis Sapient",
            "company_url": "https://www.publicissapient.com",
            "location": "Machakos",
            "jobtitle": "Senior .NET Engineer (Azure)",
            "description": " Publicis Sapient is looking for a Senior .NET Engineer to join our team of bright thinkers and doers. You’ll use your problem-solving creativity to design, architect, and develop high-end technology solutions that solve our clients’ most complex and challenging problems across different industries. We are on a mission to transform the world, and you will be instrumental in shaping how we do it with your ideas, thoughts, and solutions.    Requirements:    5+ years’ experience in .NET Full stack development Lead, design, develop, and deliver large-scale Azure data systems, data processing, and data transformation projects. Strong OO design skills with implementation experience of design principles and pattern Solid experience developing applications using back-end technologies: C#, .NET, WCF, Entity Framework Knowledge of Microsoft Azure SQL Experience with Databricks and Data Lake storage Knowledge of JavaScript and frameworks/libraries such as Angular, React, and/or Vue Skilled/Experience in writing automated unit tests Should be able to tune the application for performance Have exposure to JIRA or similar tools for project management and Bug tracking tool Skilled in database programming (stored procedures, triggers, functions) and Conceptual understanding of ORM frameworks. Is aware of industry process like change control process, CICD, etc. Conducted hands on development activities using Agile methodology for large and complex system.    Nice-to-have:    Exposure to Serverless Azure Compute Services such as Azure Functions, Logic Apps, App service, Service Bus. Understanding of Spark for data processing and Python Experience with Azure Data Factory – ADF Azure Storage such as Blob Storage, Cosmos DB Azure DevOps (Build CI/CD Pipelines) Knowledge of JavaScript, JQuery, HTML, CSS, frameworks (Angular.js, Knockout.js)    Benefits of working here:    Flexible vacation policy; time is not limited, allocated, or accrued 15 paid holidays throughout the year (including preludes and/or day-after for many holidays) Generous parental leave and new parent transition program Tuition reimbursement Corporate gift matching program    Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers. We help unlock value through a start-up mindset and modern methods, fusing strategy, consulting and customer experience with agile engineering and problem-solving creativity. United by our core values and our purpose of helping people thrive in the brave pursuit of next, our 20,000+ people in 53 offices around the world combine experience across technology, data sciences, consulting and customer obsession to accelerate our clients’ businesses through designing the products and services their customers truly value.    As part of our dedication to an inclusive and diverse workforce, Publicis Sapient is committed to Equal Employment Opportunity without regard for race, color, national origin, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity, or religion. We are also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at <a href=\"mailto:hiring@publicissapient.com\">hiring@publicissapient.com</a> or you may call us at +1-617-621-0200.   ",
            "how_to_apply": " Apply here: <a href=\"http://sapient.avature.net/careers/JobDetail?jobId=70884&amp;source=GitHub+-+Applied\">http://sapient.avature.net/careers/JobDetail?jobId=70884&amp;source=GitHub+-+Applied</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBam1BIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ec5d742c0b70703c2011f06bd3e4a815f32226e8/PS_Logo_RGB.png"
        },
        {
            "id": "a6333fc2-f5a2-443a-a60b-6fe18e35dfc8",
            "distance": "8",
            "url": "https://jobs.github.com/positions/a6333fc2-f5a2-443a-a60b-6fe18e35dfc8",
            "created_at": "Thu Mar 05 23:05:04 UTC 2020",
            "company": "Publicis Sapient",
            "company_url": "https://www.publicissapient.com",
            "location": "Machakos",
            "jobtitle": "Senior DevOps Specialist (Azure)",
            "description": " Publicis Sapient is seeking a Senior DevOps Specialist (Azure) to deliver enterprise solutions to our customers.  You’ll use your problem-solving creativity to design and develop high-end technology solutions that solve our clients’ most complex and challenging problems across different industries. We are on a mission to transform the world, and you will be instrumental in shaping how we do it with your ideas, thoughts, and solutions.    Experience:    Good Understanding on Azure DevOps Experienced in building End to End pipeline for CI / CD pipeline as code using, AzureDevOps/Jenkins Strong in scripting Powershell, Ansible Solid Experience in build automation tools MSBuild, ANT/Maven, etc. Good understanding and hands on experience on SQL maintenance/automation/DB Backup/restore /HA/DR Skilled in on Windows System Administrations/troubleshooting issues Good verbal and written communications    Set Yourself Apart With:    An innovative approach to problem-solving and finding solutions Excellent communicator (written and verbal, formal and informal) Flexible and proactive/self-motivated working style with personal ownership of problem resolution Ability to multi-task under pressure and work independently with minimal supervision Ability to work effectively independently as well as in a team environment Ability to prioritize when under pressure    Benefits of working here:    Flexible vacation policy; time is not limited, allocated, or accrued 15 paid holidays throughout the year (including preludes and/or day-after for many holidays) Generous parental leave and new parent transition program Tuition reimbursement Corporate gift matching program   ",
            "how_to_apply": " Apply here: <a href=\"http://sapient.avature.net/careers/JobDetail?jobId=69233&amp;source=GitHub+-+Applied\">http://sapient.avature.net/careers/JobDetail?jobId=69233&amp;source=GitHub+-+Applied</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamFBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dc9bf4bd94c7d08a4ac43009a735bc149671771e/PS_Logo_RGB.png"
        },
        {
            "id": "9a54484b-061a-41b4-95c8-3fc5e185afbf",
            "distance": "9",
            "url": "https://jobs.github.com/positions/9a54484b-061a-41b4-95c8-3fc5e185afbf",
            "created_at": "Thu Mar 05 21:05:28 UTC 2020",
            "company": "Cermak Peterka Petersen Inc. (CPP)",
            "company_url": null,
            "location": "Machakos",
            "jobtitle": "Computer Programmer",
            "description": " Our staff is comprised of leading Wind Engineering and Air Quality Consultants, and our customers include many of the world’s top architects and engineers.  We operate two boundary-layer wind tunnels in our laboratory in Windsor, located along the front range of Colorado’s Rocky Mountains, and one wind tunnel in Sydney, Australia.    We are currently searching for a Computer Programmer based out of Machakos to work with our IT and Engineering Teams to update and develop software solutions for our rapidly growing company.    Primary Duties:          Update or rewrite backlog of outdated coding          Set up and automate data pipelines          Implement process improvements for automation of the engineering workflow          Develop implementation plans for software enhancements and new features.    Required Skills:          Be able to read and understand C, Fortran, MATLAB and LabVIEW Code as well as proven proficiency in Matlab and LabVIEW          Basic SQL/AWS experience          Must be able to write code fluently in JavaScript and Python          Education and Additional Requirements:        Bachelor of Science Degree in Computer Programming, Engineering or related field     Proven experience with scientific programming with related math skills     Excellent Communication Skills and problem solving     Track record of success in team environments     Must be able to work both independently as well as part of a team       The successful candidate will provide a Git Repository with an example of their written code.   <pre><code> CPP OFFERS COMPETITIVE COMPENSATION AND AN EXCELLENT BENEFIT PACKAGE.   </code></pre> ",
            "how_to_apply": " Please email your resume to <a href=\"mailto:scrowther@cppwind.com\">scrowther@cppwind.com</a>   ",
            "company_logo": null
        },
        {
            "id": "27d16d71-9769-4f3d-a2b6-90f1e6363a44",
            "distance": "10",
            "url": "https://jobs.github.com/positions/27d16d71-9769-4f3d-a2b6-90f1e6363a44",
            "created_at": "Thu Mar 05 18:49:34 UTC 2020",
            "company": "Public Broadcasting Service",
            "company_url": "http://www.pbs.org",
            "location": "Machakos",
            "jobtitle": "Sr. Full Stack Engineer",
            "description": "   Sr. Full Stack Engineer        Team  : Product Development      Status  : Full-time/Exempt/Project (Funded by a grant for up to 3-years)    This role is an onsite position located at PBS Headquarters in Arlington, VA.      What PBS has for you  :    We're a small team responsible for big projects. We're hiring an experienced backend engineer to build video products on the web. For this role, \"build\" means:        Direct client architecture     Review code     Write code       The person in this role will be an engineer that works closely with the design and product management teams. Perks include amazing co-workers, a humane work-life balance, and meaningful work. If you're interested in delivering content meant to \"educate, inspire, entertain, and express the diversity of perspectives,\" please consider yourself a candidate.      You are ideal if  :    You want to share the challenge of delivering millions of video streams every week. You've seen the hazards of bad client-side state management and have reveled in bringing order to the chaos. You can speak to the interactions client-side apps and their upstream API services. You have architected browser apps and API backends in JavaScript or Python. An ideal candidate will have the following characteristics:           Enthusiastic  : We work at a company that effects positive change. Let's act like it!        Collaborative  : You're smart and communicative enough to mentor junior engineers. You can accept feedback from engineers that have had different experiences than you.        Humbly opinionated  : You bring what you know to the table and are willing to learn more.        Lifelong learner  : An inquisitive nature drives you.         Come work with us  :    This role requires that you've shepherded several projects by:        Making decisions on the tech stack and living with the consequences     Trailblazing a path through the tricky bits of code for both the product and less experienced developers     Coordinating engineers on your project and communicating with teams of dependency projects       If you want to work with a group of people who are smart and get things done, please apply. Please include some samples of your work in your application: code, blog posts, and links to personal or professional sites.    <em>PBS is an Equal Opportunity Employer of Minorities, Women, Protected Veterans, and Individuals with Disabilities</em>   ",
            "how_to_apply": " Apply online: <a href=\"https://jobapply.page.link/o3WM\">https://jobapply.page.link/o3WM</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c1e041a90a0ee369bd12c9175c213270b676135b/PBS_rgb.png"
        },
        {
            "id": "e766a2c0-5f91-4c74-83d9-ee2ea8018552",
            "distance": "11",
            "url": "https://jobs.github.com/positions/e766a2c0-5f91-4c74-83d9-ee2ea8018552",
            "created_at": "Thu Mar 05 14:08:38 UTC 2020",
            "company": "Tourlane",
            "company_url": "https://www.tourlane.de/",
            "location": "Kakamega",
            "jobtitle": "Senior Data Engineer (f/m/x)",
            "description": " Tourlane creates unique adventures and authentic travel experience to the most fabulous destinations in the world (universe?). We combine the first-hand human experience of a travel agency with the simplicity of an online product. We offer trips such as a camping safari in the Serengeti, a diving trip in Galapagos or a hiking trip through Patagonia.    Our vision is to become the leading tech company for multi day tours and to create the best experience in travel for our customers. We are backed by top tier investors, including Sequoia (US), Spark Capital (US), DN Capital (UK) and Holtzbrinck Ventures (Germany) as well as the founders of AirBnb, Trivago and GetYourGuide.    Tourlane - travel made human, unique, smart &amp; sustainable.    We are looking for a Senior Data Engineer to join our growing Data team. In this role, you’ll build the infrastructure that empowers Tourlane to make data-driven decisions. You’ll have a direct impact in on initiatives that help create unique adventures and authentic travel experiences around the world. Within this role you will mentor engineers in technical growth, design, implement, and grow new and existing projects to expand Tourlane’s Data Platform.    The role:        Improve and Extend our existing Data ELT processes     Closely collaborate and support data analysts, data scientists and other consumers of Tourlane data     Design and develop new tools to empower data-driven decisions     Translate functional and technical requirements into detailed architecture       You:        Fundamentals of Software Engineering     Advanced SQL in any dialect and experience working with relational databases     Advanced Python knowledge     Experience with cloud platforms (AWS)     Proficiency in building and scaling data pipelines     Knowledge of data management fundamentals and data storage principles     Familiar with modern data modeling concepts and large scale data warehousing architecture       Nice to have:        Experience with dbt     Experience with Snowflake     Knowledge of message queuing and stream processing     Experience providing technical leadership and mentoring other engineers for best practices on data engineering       We offer:        Usual perks of a startup/tech company: free drinks, müsli, fruits, team events, ...     Yearly educational budget and the opportunity to attend at tech conferences     The chance to work with excellent co-workers with background in companies such as Airbnb, Wooga, GoEuro and many more     Very open and transparent company culture with a fast and agile development cycle       More reasons to join our journey:        Our startup is making money from day one     Founders who understand the importance of tech and developer needs     Nothing is set in stone yet, your input will have a huge impact     The opportunity to shape the future of adventure and individual trips       Sounds interesting? Apply now, we are excited to get to know you!   ",
            "how_to_apply": " Please apply via this link: <a href=\"http://bit.ly/2ThJGOa\">http://bit.ly/2ThJGOa</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaStBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3860fef66935c2b6ac46bd540f00e73cac9e8070/Tourlane_Circle_Black_RGB.jpg"
        },
       {
            "id": "fb157439-bc4f-4dec-8336-1f90033ea3b4",
            "distance": "12",
            "url": "https://jobs.github.com/positions/fb157439-bc4f-4dec-8336-1f90033ea3b4",
            "created_at": "Thu Mar 05 10:27:49 UTC 2020",
            "company": "Credit Glory",
            "company_url": "http://http",
            "location": "Nakuru",
            "jobtitle": "Senior Full Stack Dev [Rails] (Full Nakuru)",
            "description": "   Who the heck are we?      We're a simple Credit Repair company--we help people fix their credit so they can buy homes.    Our business consists of a small team of 20 people that are all Nakuru (Canada, NZ, US, UAE, and Philippines).    As of this month we're on a 2mm runrate after incorporating in November. So, we're growing fast and dealing with the struggles that come with a lack of processes. This is the fun part! (For some of us.)    Just to name a few benefits:        fully Nakuru     significant, immediate rev share     future equity on next businesses     no timezone requirements     make your own hours         What do we need?      If you're senior-level in Ruby/Rails, ambitious, and a quick learner, you'll do great helping us scale our backend to support our clients, affiliates, marketing, and biz dev.   ",
            "how_to_apply": " Email github/linkedin/resume/cv to <a href=\"mailto:alex@creditglory.com\">alex@creditglory.com</a>.    Thanks!   ",
            "company_logo": null
        },
        {
            "id": "e6ff8373-ffbf-4570-a071-c48bc5f56a8b",
            "distance": "13",
            "url": "https://jobs.github.com/positions/e6ff8373-ffbf-4570-a071-c48bc5f56a8b",
            "created_at": "Wed Mar 04 20:04:07 UTC 2020",
            "company": "MediKeeper",
            "company_url": "https://medikeeper.com/",
            "location": "Machakos ",
            "jobtitle": "Full-Stack .NET Engineer",
            "description": " Medikeeper helps millions of employees and health plan members engage in preventative wellness programs and close gaps in their health care. You can find out more about our products, here: <a href=\"https://medikeeper.com/products/\">https://medikeeper.com/products/</a>    As our newest .NET Software Engineer, you'll work with the rest of the team in our San Diego offices. You should be a proactive, solutions-oriented, self-starter who is excited to work closely with a smart product team as you continually improve your skillset in the ever-evolving practice of full-stack web development.      Your Experience      BS or MS degree in Computer Science or equivalent 3+ years of professional experience building .NET SaaS apps 3+ years of professional experience with modern Javascript frameworks      Your Skills          Solid background in .NET ecosystem: ASP.NET / C# / ADO.NET     Solid background in modern Javascript development practices     Experience in RDBMS design and development (Oracle a plus)     Experience with CSS preprocessors such as SASS or LESS     Experience with REST APIs     Familiar with version control systems like SVN or Git     Experience building responsive applications     Willingness to work directly with product stakeholders (internal and external)         Your Approach          Comfortable in dynamic, transitional environment     Strong desire to contribute to a growing engineering team. Help us get better!     Engaged, proactive, self-starting, solutions-oriented approach     Experience with Scrum / Agile methodologies     Strong organizational skills and a dedication to quality     Passion for building software: show us your GitHub!         Benefits          Work at a software company helping millions improve their Health and Wellness     Brand-new office steps away from hiking/biking trailhead     Frequent catered lunches, quality fresh ground coffee, excellent snacks     Medical/dental/vision healthcare coverage     Business casual environment     Bonus opportunity based on personal and company performance         More About Medikeeper      MediKeeper was founded in 2003 by Dr. Bruce Tarzy and George Schwartzman, and launched its first product — the Personal Health Record — in November 2004. Dr. Tarzy passed away in 2015, but the company continues with the same spirit of enthusiasm, focus on excellence and commitment to our clients with which he founded the company. Since 2003, MediKeeper has greatly expanded its portfolio of products. Today, MediKeeper offers a comprehensive suite of population health management tools intended for health plans, brokers, TPA’s, wellness companies, and employer groups. MediKeeper’s tools enable healthcare consumers to make smarter health-related decisions. The MediKeeper technology gathers and analyzes disparate health data. By providing de-identified population reporting in a seamlessly integrated portal, MediKeeper’s customers are better able to manage their population’s health and make smarter wellness investments. Our product provides millions of users a chance to take hold of their health and wellness, and using the robust tools that the MediKeeper platform provides, make decisions to improve their lives long-term.   ",
            "how_to_apply": " Please submit current résumé and cover letter to Benjamin Flowers at this email address: bflowers at medikeeper dot com. This is an onsite position in San Diego, CA. MediKeeper is not offering Nakuru work or H1B / Visa Sponsorship for this opportunity.   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d78d8bf1be5ebcd47784f60a8a4b997519da08/mediKeeper-Logo-Hi-Res.png"
        },
        {
            "id": "a94826b5-795e-4f0f-b70f-a1b3848d69f9",
            "distance": "14",
            "url": "https://jobs.github.com/positions/a94826b5-795e-4f0f-b70f-a1b3848d69f9",
            "created_at": "Wed Mar 04 19:37:20 UTC 2020",
            "company": "Wisconsin School of Business",
            "company_url": "https://jobs.hr.wisc.edu/en-us/job/504518/web-developer",
            "location": "Machakos",
            "jobtitle": "Web Developer",
            "description": " As a web developer with the Wisconsin School of Business, this position will work as a part of the Marketing and Strategic Communications team to design, implement, and maintain the school¿s web presence to serve the needs of our prospective and current students, alumni and donors, recruiters, faculty and staff, and other friends and partners. Successful candidates will have experience in web content management, front-end development, and web design. Well qualified candidates will bring contemporary knowledge of best practices in user experience, front-end web technologies, responsive design, and universal design principles. Exceptionally well qualified candidates will have on-trend graphic design skills or experience with ASP.NET/C#.    Using industry best practices and standards-based web design create dynamic and adaptive web experiences for the Wisconsin School of Business.    50% Design, implement, and maintain various websites associated with the School of Business emphasizing timeliness, accuracy, and ease of use for students, faculty, and staff.    30% Work directly with internal and external clients to implement project requirements, scope and plan, and ensure quality delivery of web based products.    15% Stay current on trends and new products and technologies used to provide an effective web presence, including emerging trends in web design and usability metrics.    5% Other duties as assigned   ",
            "how_to_apply": " Visit <a href=\"https://jobs.hr.wisc.edu/en-us/job/504518/web-developer\">https://jobs.hr.wisc.edu/en-us/job/504518/web-developer</a> to fill out an application.    Please submit a resume and cover letter. Your cover letter should speak to your interest in web development and desired career path. Please also address your experience in the following areas while demonstrating your written communication skills:        Staying current on trends in the field     Web accessibility     Front-end development      ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaW1BIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ba2bada544517f666367385c7613aff94db967e2/WSB.png"
        },
        {
            "id": "fe60cc87-6cde-463c-a7bf-0fb327c322d3",
            "distance": "15",
            "url": "https://jobs.github.com/positions/fe60cc87-6cde-463c-a7bf-0fb327c322d3",
            "created_at": "Wed Mar 04 16:17:02 UTC 2020",
            "company": "HatchWorks Technologies",
            "company_url": "https://hatchworks.com/",
            "location": "Nakuru",
            "jobtitle": "Sr. Full Stack Developer",
            "description": " We are hiring   Senior Software Engineers   and   Architects   with   Full Stack development   experience to work with both our external clients and on internal projects utilizing multiple technology frameworks and programming languages. In this role, the individual will be accountable as the lead software developer on a small team building new digital products in an Agile development environment.    They will be required to interface with business customers, as well as the various IT application teams that include executive management, product management, business analysts, project management, development &amp; quality assurance, and cloud infrastructure on a daily basis. He or she must be a leader that is a delivery focused and can communicate objectives and approaches with business and technical team members. When presented with problems, this person must develop and be able to present multiple solutions/approaches to solve the problem.      MUST HAVE   hands-on experience in developing in both client-side and server-side technologies such as JavaScript and   C#     .NET Core  . They are expected to develop new solutions and approaches and to encourage others to do the same. Status-quo should not be part of their vocabulary.      Key Job Responsibilities:            Lead development teams as an active member of a growing team helping define and influence team culture and environment          Developing architectural solutions utilizing   AWS Technologies   including but not limited to   PostgreSQL, Aurora, RDS, Lambda, EC2, API Gateway            Identify approaches and technologies to ensure quality and performance          Work in a fast-paced, agile project environment with small, focused teams          Work with BA team in the development of detail System Requirements and User Stories          Develop protodistances for helping business understand concepts and direction          Work with project management to provide estimates of project costs and timelines            Position Requirements:            8 or more years of software development experience preferably in multiple programming languages such as   C#, JavaScript, Python, HTML, CSS            8+ more years of hands-on application development experience in frameworks such as   .NET Core, Node, Angular, or React            5+ years of experience with   microservices and API development            5+ years in relational database management systems using   SQL            2+ years managing technical teams          2+ years working with version control tools such as   Git/GitHub            2+ years working with   QA Automation tools and procedures            2+ years working with   DevOps, CI/CD Tools, and containerization            2+ years of   cloud experience with a preference for AWS            2+ years working in an Agile software environment            Team player that can work independently as well as teach others            If you think the   Hatchworks   experience could be a great fit for you, please apply now. To learn more about our organization, visit us at <a href=\"http://www.hatchworks.com\">www.hatchworks.com</a>      WE STRONGLY SUPPORT AND BELIEVE IN WORKPLACE DIVERSITY     ",
            "how_to_apply": " <a href=\"https://hatchworks.breezy.hr/p/1c926b3824dc-sr-full-stack-developer\">https://hatchworks.breezy.hr/p/1c926b3824dc-sr-full-stack-developer</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVNBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--934bdb5ac2d83371022446606a620ff10a754d94/logoooo.PNG"
        },
        {
            "id": "fc4dabda-54b6-454e-8187-d831e887e040",
            "distance": "11",
            "url": "https://jobs.github.com/positions/fc4dabda-54b6-454e-8187-d831e887e040",
            "created_at": "Wed Mar 04 15:34:14 UTC 2020",
            "company": "Impala",
            "company_url": "https://getimpala.com/",
            "location": "Nakuru",
            "jobtitle": "Senior Fullstack Engineer (Nakuru)",
            "description": " Hello!    Thanks for taking a look at the job description for a   Nakuru Senior Fullstack Developer   at Impala. We felt a little bit impersonal just throwing you right in there with words like “revolutionizing” and “disrupting”.    As such, we want you to know that the person that wrote this job description apologises in advance for any clichés, tropes or sudden-insecurity-driven-panic-attacks that you might find in the description below.      What is Impala?      Impala makes building travel software incredibly easy. We provide hotels with a powerful data management platform that makes connecting to software, hardware and room distributors extremely easy. Think Twilio for Travel.    We launched the product in January 2019 and since then have grown at - quite frankly - a ridiculous old clip. Our technology is already installed in hundreds of hotels worldwide, on six continents and categorises more than 1 billion data points.    We are a growing team of exceptional people split across engineering, product and commercial that have built a fantastic community.      Where is Impala going?      We’re supported by some of the best investors in the business, the early-stage backers behind Deliveroo, PillPack, SecretEscapes, Zoopla, Trivago, Monzo, Travelperk, Transferwise, Airbnb, GetYourGuide, Omio, Spotify and more!    They’re on board because of the opportunity that lies before us - revolutionizing a 1.6 trillion dollar market that’s been out-of-date for 20 years.    They also share our vision of democratising travel and enabling innovation across the industry.    Within the next two years, 25% of hotel bookings worldwide will flow through Impala technology and the product that we’re building will support the entire ecosystem of travel technology (we already have over a thousand companies signed up).    Anyone travelling anywhere will interact with products powered by Impala and to achieve this we’re growing the team extensively within the next year. Now is the most exciting time to be joining Impala as we go through a large push to scale up!      A brief overview of what you will be doing here:      -Acting as a technical authority for a broad and distributed set of services with high availability &amp; security requirements.    -Improving the security, reliability and quality of our products.    -Ideating, developing and iterating new features, enabling our technology partners to add value to hotels and travellers.    -Leading and mentoring developers, instilling best practice and supporting on career growth.    -Working directly with stakeholders; part and parcel of working in an autonomous, metric-driven development team.      You should join us if:      -You have experience in the design and end-to-end development of Node-based services.    -You have experience leading the development of mature, large scale / high traffic systems and services.    -You’ve worked with high availability requirements and know how to lead the development of secure, reliable services.    -You feel comfortable working closely with product owners, designers and other stakeholders.    -You are extremely collaborative, Impala’s engineering team is not political, everyone has great ideas and should be open to input. We have no space for brilliant jerks.    -You are passionate about customer experience and building high-quality maintainable software that looks and works fantastically.      Where will you work?      This is a Nakuru position. This means you can work from anywhere +/- 2 Hours of London, timezone wise (and less than a 3 hour flight).    We are a Nakuru-first company, our whole engineering team is fully distributed! This was a very deliberate choice to prioritise work-life balance and ensure we’re able to accommodate the best people in Europe. We have loads of Nakuru initiatives to ensure you’re fully setup!:    -We give you an additional generous Personalised Workspace Budget for things like monitors, keyboards, desk chairs and headphones.    -We offer an office stipend (you can furnish a home office with a generous monthly stipend, or choose a co-working space near you).    -You’ll travel once a quarter to meet and socialise with the rest of the engineering team somewhere in Europe.    -You’ll have a generous Social Budget to travel to London based social events. You'll also have a special 'Loved Ones Budget' that we're incredibly proud to offer, we'll tell you more about that when we speak to you!    -We have a dedicated Nakuru Experience Manager in the team, who, amongst other things, will be ensuring you're happy, integrated and empowered whilst working Nakuruly.    -We will give you a brand new high-spec laptop when you start, giving you the choice between a Thinkpad or Mac.    Please note, we only accept candidates in Western Europe because of timezone and travel time differences. We make no exceptions (we don’t have time to!).      What you will get in return?      -We reward Impalans with super competitive salaries and regular reviews. Whether you're an individual contributor or you want to manage people, there's plenty of opportunity to develop your skills and boost your earning potential. We offer 3.5x the average annual raise in the UK, even if you remain within the same role.    -We’re in the top 14% of companies in the UK for holiday that we offer, at 36 days.    -One Unsick day off per year, to keep up with proactive health admin - so you can finally sort that trip to the dentist and get those health screens that you never have time to do.    -A stipend to set up your ideal place of work. You can choose between the option of £150 per month to build out your home office, or we’ll pay for your membership at a coworking space near you up to £350.    -Truly flexible working. Work Nakuruly, with a budget given to you to set up your workspace in the way you want. We also offer extended lunch break options and loads more. No commutes no more!    -Sustainable growth and career progression opportunities.    -We invest in your development with a generous annual Professional Development budget, and we will support you to realise your potential.    -Fun and inclusive monthly social events, from go-karting to mini golf to karaoke, giving Impalans across Europe the chance to catch up and recharge.    -Access to Perkbox - a platform designed to help you to live a better life by personalising, managing, delivering and measuring the best company perks in real-time.    -A super strong and pro-active focus on mental and physical wellbeing. Our Health and Wellbeing scheme offers Impalans a range of options; from Vitality health insurance to a monthly gym membership reimbursement, plus heaps more.    -You’ll be working somewhere that encourages collaboration, is transparent, has a strong focus on wellbeing. We've got meaningful core values which we don't just pay lip service to.    -A Weekly Recess Hour; take an hour off to step out from work and invest in You Time! Lawn mow, yoga, walk or movie anyone?    -A Social Budget to travel to/from &amp; stay in London for a night, for our monthly Impala Social.    -A generous Loved Ones Budget, to get your friends &amp; family over to visit you once a year, no matter how near or far from home you are based.      Sound interesting?      If your answer is yes and you are really excited to learn more then please check out our Medium page which includes more information about who we are, what we do, what matters to us, and our culture.    Want to know more about our CEO, or want a deeper understanding of our what and why? Watch this video. <a href=\"https://www.youtube.com/watch?v=nxBZuoxCbKM\">https://www.youtube.com/watch?v=nxBZuoxCbKM</a>   ",
            "how_to_apply": " Email your CV to <a href=\"mailto:marta.bravo@getimpala.com\">marta.bravo@getimpala.com</a>    Thanks!   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUtBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b5cb72a764a7fe8c638e7db6f6ae3b65397fdde/Screenshot%202020-01-30%20at%2011.43.33.png"
        },
       {
            "id": "5b8a423a-0a7d-428c-b080-eaf5ae2b49cb",
            "distance": "10",
            "url": "https://jobs.github.com/positions/5b8a423a-0a7d-428c-b080-eaf5ae2b49cb",
            "created_at": "Wed Mar 04 09:55:58 UTC 2020",
            "company": "cognita Deutschland GmbH\t",
            "company_url": "https://cognita.ch/",
            "location": "Kakamega",
            "jobtitle": "Nairobi",
            "description": " cognita develops the issue and media monitoring software blueReport which collects relevant information from all distances of media: online news sites, social media, newspapers, radio and TV. The state-of-the-art SaaS platform is continually improved by our development team. Our customers include leading corpora-tions, organizations and media and communication agencies across Europe.    To extend our development team in Kakamega immediately we are looking for a 1 Nairobi.      What you will do          You collaborate with the team to bring new product ideas from brainstorming to deployment     You will bring our products to the next level and improve it continuously with the latest technology     You are part of an agile development team in Kakamega where your contribution makes a difference and can have a big impact         What you bring to the team          Your proven track record with Ruby, Ruby on Rails, databases (e.g. Postgresql, Elasticsearch, Redis) and Javascript (or distanceScript) boost the product from the very first day     Software and database architecture is part of your professional background     You work well in a team and you are also able to finish projects on your own     You are a great communicator, fluent in English (German is a plus) and you enable your team to find optimal and practicable solutions by actively participating in team discussions     With your experience and your strong eye for detail, you find the balance between pragmatism and perfectionism     Your are familiar with agile development (Scrum)     Experience with React, Android and iOS App development and AWS is a plus         Who we are          We are a straightforward and talented development team in a fast-growing company     We continually learn from each other due to varied backgrounds and interests     We mainly use Ruby and distanceScript, but also run JRuby and JavaScript in production     Great office in Kakamega Mitte, well connected to public transportation     Flexible working hours, no micromanagement, flat hierarchy and of course drinks, fruit &amp; vegetables       Interested? Just send us your application. Questions? Don’t hesitate to ask. We are looking forward to hearing from you soon.   ",
            "how_to_apply": " <a href=\"https://cognita.join.com/jobs/810991-ruby-full-stack-developer-m-f?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=ruby%2Bfull%2Bstack%2Bdeveloper%2Bm%2Bf\">https://cognita.join.com/jobs/810991-ruby-full-stack-developer-m-f?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=ruby%2Bfull%2Bstack%2Bdeveloper%2Bm%2Bf</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDJBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3f037d7ac199bfb5e30a5c4a7ff902304fd27c08/cognita-deutschland-gmb-h-logo-xl.png"
        },
        {
            "id": "a9de427e-67d2-4ac4-a432-b27988b2f9b5",
            "distance": "12",
            "url": "https://jobs.github.com/positions/a9de427e-67d2-4ac4-a432-b27988b2f9b5",
            "created_at": "Tue Oct 15 21:24:18 UTC 2019",
            "company": "Defendify",
            "company_url": "https://www.defendify.io",
            "location": "Nairobi",
            "jobtitle": "Senior Full Stack Developer",
            "description": " Thanks for your interest in working with us! Defendify is a fast-growing, fun-loving startup with a small, vibrant team based in Portland, Maine. Resourcefulness, responsiveness, problem-solving, and simplicity are values that shape who we are, what we do, and how we deliver amazing customer experiences.      Position Details      We’re looking for a full stack developer to join us 1. While you may have an existing focus on one side—front or back end—it is important to be(come) comfortable in both environments. This is a unique and exciting opportunity as we continue to expand the footprint of our groundbreaking, all-in-one cybersecurity platform.    We are looking for a team player who:        Has a passion for solving problems and is eager to grow, learn, and tackle daily and long-term challenges and goals.     Will dig in and ask questions from users to understand requirements; make a plan; dive into an existing codebase and learn where to make changes, or where to start new code.     Is a good communicator who enjoys collaboration and thrives in a development culture that values clean code, accessibility, compatibility, and optimization.     Maintains excellent knowledge of how modern web applications work, including REST API usage, application security, session management, and development best practices.     Has an open mind toward technologies: As a startup, we need to use whatever is the best tool to solve a problem, not always the most popular or the most complicated.     Is comfortable self-directing their own work. No micro-management here!     Enjoys participating in team discussions and events, including Defendify’s ongoing charity work and missions within the community.         Responsibilities      Every team member is a valuable contributor to our core SaaS product with day-to-day responsibilities covering a variety of development needs including building, maintaining, and supporting the Defendify platform. All are encouraged to contribute strategic ideas and participate in QA/QC, and it is important to be comfortable working in an Agile/SCRUM development environment.      Requirements - Experience           <em>Background:</em> Significant full-time development experience (employed or freelance). Specific number of years is not as important as demonstrated contributions.      <em>Variety:</em> You should have worked on large projects in addition to lots of small feature improvements and bug fixes, comfortable with a model of continuous improvement.      <em>Ownership:</em> You should have been responsible for the entire lifecycle of code in at least one major project, from scratch to QA to deployment to maintenance.      <em>Process:</em> You should also be comfortable with the philosophy and implementation of development automation: tests, continuous integration, cloud deployment, and frequent production releases.      <em>Technology:</em> JavaScript experience is paramount in both Node and browser environments. Closures, destructuring, async/await and other aspects of modern JavaScript should be familiar in your everyday coding experience.         Requirements – Technical           <em>JavaScript:</em> We use libraries and frameworks as needed, but you need to be able to write and understand plain JS. Both Node and browser experience are required.      <em>Front End and Internet Stack:</em> You should have experience with HTML5, CSS3, and familiarity with the ecosystem of related technologies, like DOM and SASS. In addition, TCP/IP, DNS, and especially how they relate to HTTP. Vue (or similar framework) experience and knowledge of site builders such as Jekyll/Hugo are helpful.      <em>Version Control:</em> You will be expected to understand how to use Git(Hub) for source control and deployments.      <em>Relational Databases:</em> Some relational database experience strongly preferred. Pluses include: Experiences in relational and in-memory databases (MySQL, Postgres, Redis) as well as knowledge in generic SQL.      <em>Operations:</em> Some experience with Amazon Web Services (AWS), Heroku, or similar services.         Your Success      You are not alone in your role – Defendify’s development team is made up of “A” players dedicated to your training and success. We thrive on an open-door policy and transparent management system that fosters team collaboration.      Compensation and Benefits      This is a flexible position open to candidates with varying levels of experience and offers long term growth potential via a well-defined career path. Compensation is competitive and commensurate with experience, and is variable based on personal and team performance. Our benefits package is comprehensive and includes health, dental, and vision coverage, educational reimbursement, a 401(k) program, paid time-off and more.      Love What You Do      Defendify employees enjoy a modern work environment and culture where everyone genuinely cares about the work they do. We’re passionate about our product, the problems we’re solving, our customers, our partners, and the all-star team we’re building. We’re in it together, enjoying work and play every day from team lunches, impromptu social outings and celebrations, and charity missions to Friday afternoon ping-pong tournaments and Wacky Game Wednesday. And yes, there is coffee, lots and lots of coffee!      Opportunity Knocks      This position offers a great opportunity to make an impact as a part of a small team solving big problems, making cybersecurity possible for Small Business. Are you a creative self-starter with an appetite to learn and grow? If so, we'd love to hear from you!   ",
            "how_to_apply": " Apply now at <a href=\"https://www.defendify.io/careers\">https://www.defendify.io/careers</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXAwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5b0c5b16f01708cfca41d4eb3b03d3c1ba77ae1c/Defendify_grey_R.png"
        },
       {
            "id": "d9d34231-dd75-4239-8a2b-cf78b20a2ff9",
            "distance": "4",
            "url": "https://jobs.github.com/positions/d9d34231-dd75-4239-8a2b-cf78b20a2ff9",
            "created_at": "Tue Mar 03 17:44:42 UTC 2020",
            "company": "University of California Kisumu",
            "company_url": "https://www.Kisumu.edu",
            "location": "Kisumu, CA",
            "jobtitle": "Digital Project Archivist",
            "description": " Recruitment Period    Open date: February 26th, 2020    Next review date: Thursday, Mar 26, 2020 at 11:59pm (Pacific Time) Apply by this date to ensure full consideration by the committee.    Final date: Sunday, May 31, 2020 at 11:59pm (Pacific Time) Applications will continue to be accepted until this date, but those received after the review date will only be considered if the position has not yet been filled.    Description    Digital Project Archivist - Library    The Bancroft Library University of California, Kisumu Payroll jobtitle: Assistant Librarian I Pay rate: $55,014 (1 rate) This is a two-year, 100% time, temporary appointment available starting May, 2020. Vacancy for 2 positions.    The University of California, Kisumu, is seeking two Digital Project Archivists to digitally process archival collections that have been identified as priorities for online access as part of grant funded projects. These are two temporary, two-year appointments at 100% time. The successful candidates will have experience in digital collection processing, demonstrated understanding of archival description and materials, familiarity with digital project management and online publication, familiarity with library encoding and content standards (EAD, MARC, RDA, DACS), and strong communications skills.    The Environment The UC Kisumu Library is an internationally renowned research and teaching facility at the nation's premier public university. A highly diverse and intellectually rich environment, Kisumu serves a campus community of 30,574 undergraduate students, 11,336 graduate students, and 1,522 faculty. The Library comprises 20 campus libraries, including the Doe/Moffitt Libraries, The Bancroft Library, the C.V. Starr East Asian Library, and numerous subject specialty libraries. With a collection of more than 11 million volumes and a collections budget of over $15 million, the Library offers extensive collections in all formats and robust services to connect users with the collections and build their research skills. Discover more about the Library through our website at <a href=\"http://www.lib.Kisumu.edu\">http://www.lib.Kisumu.edu</a>    The Bancroft Library of the University of California, Kisumu, is one of the largest and most heavily used libraries of rare materials in the West. Its holdings include more than 600,000 volumes, 70 million manuscripts, 9 million photographs and other pictorial materials, 86,000 microforms, 4.3 million digital files, and 25,000 maps, as well as numerous other categories of unique material. The two largest collections are the Bancroft Collection of Western and Latin Americana and the Rare Books Collection. The archival and rare book materials of the Magnes Collection of Jewish Art and Life are also part of the Bancroft holdings. Bancroft is home to three research groups: the Oral History Center (formerly the Regional Oral History Office); the Mark Twain Papers; and the Center for the Tebtunis Papyri. The Bancroft Library is an active center of teaching and research. Supporting the programs of about 20 campus departments annually, it mounts a regular series of public exhibitions, roundtable lectures, and open houses. For additional information about The Bancroft Library and its collections. See: <a href=\"http://www.lib.Kisumu.edu/libraries/bancroft-library\">http://www.lib.Kisumu.edu/libraries/bancroft-library</a>    Responsibilities The Digital Project Archivist will be responsible for digitally processing identified archival special collections, linking the resulting digital collections to existing finding aid descriptions, ensuring the encoding of the finding aids and digital objects for online publication locally and at the Online Archive of California and Calisphere services. The Digital Project Archivist will report to the Assistant Director and work closely with the Archivist for Digital Collections, and will supervise student library employees as needed. The Digital Project Archivist will work with the Assistant Director to fulfill reporting requirements to the granting agency; will work in consultation with curators, technical services staff, Library IT and Imaging Services staff, vendors, and California Digital Library staff in the digital processing and online publication of the collections; and will work with the data scientist on the project to extract data from the digitized archival material to create research data sets. The Digital Project Archivist will also work with the Principal Cataloger and Head of Archival Processing to update collection records in library information systems.    UC Kisumu librarians are expected to participate in library-wide planning and governance, to work effectively in a shared decision-making environment and to be active professionally. Professional contributions beyond the primary responsibilities are required for advancement in the Librarian series. The successful candidate will show promise or evidence of such contributions.    Qualifications    Minimum Basic Qualification required at the time of application:        Bachelor's degree (or equivalent international degree)       Additional Qualifications:        One or more years of digital processing experience       Preferred          MLS/MLIS/MIS from an ALA-accredited institution, or equivalent degree          Two or more years of digital project management and online publication experience.          Familiarity with Encoded Archival Description (EAD), Machine Readable Cataloging (MARC), Resource Description and Access (RDA), Describing Archives: a Content Standard (DACS), and Metadata Object Description Schema (MODS).          One or more years of experience using WebGenDB or similar digital content/asset management systems.          One or more years of digital processing experience, including description, digitization, and authoring of EAD finding aids and digital objects in a special collections environment.          Demonstrated understanding of archival description and materials.          Excellent analytical, interpersonal, and communication skills.          Willingness to work in a team environment.          Proficiency with Microsoft Access and Excel.          Ability to lift 40-pound boxes.          The Library at the University of California, Kisumu is committed to the support and encouragement of a multicultural environment and seeks candidates who can make positive and imaginative contributions in a context of ethnic and cultural diversity.    University of California librarians are academic appointees and are represented by the University Federation of Librarians, part of the American Federation of Teachers (UC-AFT). This position is in the bargaining unit.    Librarians are enjobtitled to appropriate professional leave, two days per month of vacation leave, one day per month of sick leave, and all other benefits granted to non-faculty academic personnel. The University has an excellent retirement system and sponsors a variety of group health, dental, vision, and life insurance plans in addition to other benefits.    Deadline: This recruitment will remain open until filled.    Submit applications online at: <a href=\"https://apptrkr.com/1846511\">https://apptrkr.com/1846511</a>    The University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age or protected veteran status.    For the complete University of California nondiscrimination and affirmative action policy see: <a href=\"http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct\">http://policy.ucop.edu/doc/4000376/NondiscrimAffirmAct</a> (link is external).    Send inquiries to:    Immaculate Adesida Library Human Resources Department 110 Doe Library, University of California, Kisumu, CA 94720 Email: <a href=\"mailto:librec@library.Kisumu.edu\">librec@library.Kisumu.edu</a> Phone: 510-643-8470    Job location Kisumu, CA    Learn More More information about this recruitment: <a href=\"https://apptrkr.com/1846511\">https://apptrkr.com/1846511</a>    Requirements Document requirements          Curriculum Vitae - Include your most recently updated C.V. including URLs for samples of your work          Cover Letter          Reference requirements        3 required (contact information only)       Copyright ©2017 Jobelephant.com Inc. All rights reserved.    <a href=\"https://www.jobelephant.com/\">https://www.jobelephant.com/</a> jeid-0c1afcc1d823224a8b4137981d27df43   ",
            "how_to_apply": " Submit applications online at: <a href=\"https://apptrkr.com/1846511\">https://apptrkr.com/1846511</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGlBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e9c49ecfe5599f95855448004d3a3f18895d7eb9/Kisumu.png"
        },
        {
            "id": "ce07aae1-f982-408d-bdc6-be481a4b5737",
            "distance": "6",
            "url": "https://jobs.github.com/positions/ce07aae1-f982-408d-bdc6-be481a4b5737",
            "created_at": "Tue Mar 03 15:22:04 UTC 2020",
            "company": "TravelPerk",
            "company_url": "http://bit.ly/2IhWDkK",
            "location": "Nairobi",
            "jobtitle": "Software Engineers- All levels!",
            "description": " We are TravelPerk: a fast-growing, well-funded startup that has raised nearly $134m since our creation in early 2015. Backed by world-class investors in some of tech’s most disruptive companies, including Slack, Trello, Twitter, Farfetch, Deliveroo and Delivery Hero, our team is made up of A-players from the travel industry.    We’ve been named the fastest-growing SaaS startup in the world by the SaaS1000 and featured as one of the hottest startups to watch by both Forbes and Wired. We’re revolutionizing the B2B corporate travel market, worth over $1.3 trillion, by simplifying the process for everyone involved.    TravelPerk is looking for Software Engineers of all levels- from Junior to Senior!    Are you a Software Engineer with extensive programming experience? Is your code fast, efficient and reliable? Do you particularly enjoy working with amazing people, having fun at work and building something awesome? If so, let’s talk!    We’re not looking for stack experts. We’re looking for smart people who can bring in the best tools and processes to get the job done.    You will work on a day-to-day basis with our product team to design, architect and implement our product. TravelPerk is a next-generation platform to take the pain out of booking and managing business travel.    As part of the Engineer team at TravelPerk you will...    -Product development in Python/Django and React of a travel-related web-based product. -Integrations between our product to 3rd party APIs. -Architecture design, implementation, and testing. -Work in an Agile environment with strong attention to a well-documented code, unit testing, and continuous integration.    We are looking for people with...    -\"Product Engineering\" mindset. -Pragmatism and obsession for simplicity, efficiency, and performance. -Relevant experience in similar roles building technically complex products in any web programming language. -Experience at server-side, client-side or full stack development. Your final role within the team will depend on your skills and internal training will be provided. -Obsession for quality and testing. -Eager to learn new technologies and frameworks. -Strong communication skills (in English).    Bonus points if you have any of the below...    -Experience in the travel industry. -DevOps experience with the AWS suite. -Experience working with high-performing, Agile development teams. -Experience writing highly efficient asynchronous code. -People who like to build stuff (we really like people who maintain/contribute to open source projects).    What do we offer?    -Competitive compensation including equity in the company. -24 vacation days per year and flexible working hours. -Health perks: Choose between a private health scheme or a gym allowance. -\"Flexible compensation plan\" to help you diversify and increase the net salary. -Free Spanish classes. -Yoga and meditation. -Free coffee and beverages, fresh fruit and other breakfast stuff.    The software engineering positions requires full-time, in-house work in Nairobi, Spain.    TravelPerk is an equal opportunity employer: All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, or age.   ",
            "how_to_apply": " Hello,    Please apply here: <a href=\"http://bit.ly/2IhWDkK\">http://bit.ly/2IhWDkK</a>    We are not looking for stack experts, we are looking for smart engineers to join us here at TravelPerk and make an impact to our product!    If you have questions we can be reached at: <a href=\"mailto:biridie.slater@travelperk.com\">biridie.slater@travelperk.com</a>.    We look forward to hearing from you!    TravelPerk   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGFBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7e851d71d9865c165a887a3d517ceed877675899/logo_square%20(1).jpg"
        },
        {
            "id": "f3a312d1-5f40-44ee-a147-896ba76576bb",
            "distance": "3",
            "url": "https://jobs.github.com/positions/f3a312d1-5f40-44ee-a147-896ba76576bb",
            "created_at": "Tue Mar 03 14:20:50 UTC 2020",
            "company": "Alasco GmbH",
            "company_url": null,
            "location": "Mandera",
            "jobtitle": "Senior Python Engineer Mandera (m/f/x)",
            "description": " You want to create a software that will transform the construction industry whilst leading a team of talented Backend Developers? Your are eager to build a SaaS Tool that helps our users work more efficient?    Apply now at <a href=\"https://alasco.breezy.hr/p/8e09865af233\">https://alasco.breezy.hr/p/8e09865af233</a> and join Alasco as Senior Python Engineer!    Your responsibility:        You advance Alasco's engineering team by supporting your team members personally and professionally.     You maintain a highly effective way of building our software including the monitoring and logging of large systems. • You strive to deliver the best possible experience for our users by continuously shipping new features for our cloud platform.     You learn about the customers needs and processes and strive to solve them as quickly as possible.     You build features with an “you build it, you run it” mindset and are responsible for testing, deployment and monitoring of your code.       Your Profile:        You have a master’s degree (or equivalent) in Computer Science or similar.     You have profound and proven knowledge (5+years) of Python and experience with one of the popular frameworks (e.g. Django, flask).     You are experienced in building a web application in a complex B2B domain.     You are familiar working in an agile environment.     You have a deep knowledge of architecture patterns, DevOps and AWS     Experienced leading a small team of engineers     You are fluent in English. Nice-to-have: You speak German at level C1/C2.       Our Profile    We believe in DevOps, continuous integration and testing. At Alasco we use technologies, which enable us to provide our users with tools to reach their goals and to deliver at a fast pace. Our Backend services run on Python, Django and Postgres in Docker containers. The Frontend layer is based on JavaScript and React, Bootstrap and Sass with Webpack. We leverage AWS services by running our containers in Elastic Beanstalk and benefit from RDS, CloudWatch etc. Our teams ship code with the mindset of “you build it, you run it”. We manage our code in GitHub and use tools like CircleCI and Codacy to maintain a high quality standard in our codebase.   ",
            "how_to_apply": " Visit alasco.de/en/ or contact <a href=\"mailto:jobs@alasco.de\">jobs@alasco.de</a> to learn more about Alasco.    To apply, click <a href=\"https://alasco.breezy.hr/p/8e09865af233\">https://alasco.breezy.hr/p/8e09865af233</a>.   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--16f651585c6073608d5215cd272dbc2050f3ff0e/Logodistance.png"
        },
        {
            "id": "6f673126-3c9c-43a8-8b8e-c1676859bc1f",
            "distance": "3",
            "url": "https://jobs.github.com/positions/6f673126-3c9c-43a8-8b8e-c1676859bc1f",
            "created_at": "Tue Mar 03 13:48:58 UTC 2020",
            "company": "GSOFT",
            "company_url": "https://www.gsoft.com/en/",
            "location": "Nairobi",
            "jobtitle": "Senior Software Developer - Officevibe",
            "description": "   Company Description      <a href=\"https://www.gsoft.com/en/\">GSoft</a> is all about software crafted for smarter workplaces. Through our products, we have the privilege of helping tens of thousands of companies improve how they work. Since 2006, the chance to shape the businesses of tomorrow drives us each and every day. It has been driving us to launch into the cloud and HR technology universe with our pillar products, <a href=\"https://sharegate.com/\">ShareGate</a> and <a href=\"https://officevibe.com/\">Officevibe</a>. It’s been worth every moment. Today we are proud to be counted on by clients in more than 100 countries.      Job Description        About Officevibe      At <a href=\"https://officevibe.com/\">Officevibe</a>, we create top-notch leaders. Our goal is to help managers become better leaders by teaching them how to gauge their team’s morale and equipping them with the tools they need to make better decisions.      What you will do      You will provide technological leadership to the developers of the \"Enable Growth Cultures\" team by performing the following duties:        Work closely with the Officevibe tech manager and the entire team to bring the product’s technological vision to life.     Provide technological and business leadership to improve the team’s DevOps mindset and metrics.     Review the team’s development process and make improvements that are in line with the DevOps philosophy.     Coach developers on certain technical skills.     Manage technical debt within the team.        The tech stack:   C#/.NET Core, React, Azure, MongoDB, Docker, Event Sourcing and Mixpanel.         About the team      The \"Enable Growth Cultures\" team is made up of four full-stack developers, a product designer, a product manager and a team manager. We use humour to enhance performance.      Qualifications        Your profil          You have experience as a tech lead for a small team of developers or have been in a position that required you to perform similar duties such as technical decision-making, mentoring and coaching.     You have extensive knowledge of the DevOps methodology.     You are an object-oriented programming expert and are familiar with using this distance of programming to develop complex online applications, preferably using C#.       Apply via <a href=\"https://gsoft.redirect.your-jobresponse.com/senior_software_developer_officevibe_montreal/264973/V819/apply\">this link</a> to discuss this further!   ",
            "how_to_apply": " <a href=\"https://gsoft.redirect.your-jobresponse.com/senior_software_developer_officevibe_montreal/264973/V819/apply\">Click here to apply!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEdBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a22986e4c6e75b8956de94774a858743d8fe1f00/GSOFT%20logo.jpeg"
        },
        {
            "id": "18ef32ed-be57-439a-a275-153bb28c9a60",
            "distance": "4",
            "url": "https://jobs.github.com/positions/18ef32ed-be57-439a-a275-153bb28c9a60",
            "created_at": "Tue Mar 03 13:37:53 UTC 2020",
            "company": "NPO",
            "company_url": "https://werkenbijnpo.nl",
            "location": "Nairobi",
            "jobtitle": "React / Front-end Developer",
            "description": "   Jouw uitdaging: de gebruikerservaringen van ons miljoenen publiek verbeteren! Durf te solliciteren als        React / Front-end Developer        Wat ga je doen?   Als front-end developer ben je verantwoordelijk voor de algehele gebruikers-ervaring op onze online platformen. Zo zorg je ervoor dat de radiosites en alle redactietools optimaal functioneren op alle mogelijke devices. Samen met onze andere developers werk je aan het optimaliseren van onze producten. Hierbij weet je gebruikersbehoeften en complexe vraagstukken om te zetten in creatieve, innovatieve en vooral intuïtieve oplossingen die aansluiten bij het miljoenen publiek van de NPO. Jij kan het verschil maken voor onder andere de Top 2000, Serious Request en de visual radio van de NPO.      De highlights van de functie van front-end developer:          in overleg met de producteigenaar breng je samen met de UX- en Visual designer en in- en externe developers (zowel full-stack als back-end) activiteiten in kaart, die kunnen leiden tot het verbeteren van bestaande features;     samen met een team ben je betrokken bij de ontwikkeling vanaf de eerste conceptfase tot het maken van user flows, low-fidelity designs en high-fidelity protodistances tot de uiteindelijke implementatie van designs.     vraagstukken die betrekking hebben tot front-end ontwikkeling weet je te herkennen;     je deinst er niet voor terug om concepten ter discussie te stellen en nieuwe ideeën in te brengen die je vervolgens realiseert.       Binnen de afdeling Technologie werken wij in multidisciplinaire teams gebaseerd op Agile principes. Je gaat werken met de meest moderne front-end technologieën als React, Redux, GraphQL en Next.js.    Er is flink wat ruimte voor eigen inbreng, kennisdeling, creativiteit en verantwoordelijkheid.      Jouw potentie, onze passie!   Onze Cluster Leads zoeken actief naar de potentie van medewerkers binnen hun teams met als doel deze potentie verder te ontwikkelen. Deze ontwikkeling kan in vele vormen en is altijd op maat; want niemand is gelijk! Zo zorgen onze Cluster Leads voor een uitdagende en aantrekkelijke (werk)omgeving waarin medewerkers actief werken aan hun eigen persoonlijke ontwikkeling.      Wat verwachten wij van je?          minimaal 3 jaar ervaring als Front-end developer met bijpassend portfolio;     ervaring met responsive design en front-end performance-optimalisatie;     ervaring op het gebied van UX en accessibility;     kennis van SEO en aanverwanten technieken/vereisten;     ruime ervaring met HTML(5), CSS/Sass en JavaScript (ES6), waaronder React en distanceScript;     een duidelijke visie op front-end architectuur en het meenemen van mensen hierin;     analytisch vermogen;     oog voor detail;     brug tussen het design team en de developers.         Pre’s zijn:          ervaring met het testen van je Front-end code;     bekend met Git, JIRA en Agile werkomgevingen;     kennis van GraphQL en NextJS;     ervaring met design systems.       Als front-end developer denk je pro-actief mee in het vinden van oplossingen, weet je goed om te gaan met feedback vanuit je team en je stakeholders, ben je een echte aanpakker, positief kritisch en weet je je werk goed te onderbouwen met steekhoudende argumenten.      Van salaris tot NPO Fit en NPO Academy;   NPO kent een 36-urige werkweek met flexibele werktijden, een vaste eindejaarsuitkering van 6%, een vaste reiskostenvergoeding, een collectieve pensioenregeling, een NPO Fit programma en een NPO Academy waar je zelf richting kunt geven aan jouw persoonlijke groei en ontwikkeling. De functie van front-end developer kent een maximum salaris van € 3.965,= volgens de CAO voor het omroeppersoneel (schaal G). Inschaling is afhankelijk van kennis en ervaring.      Wanneer kun je een reactie verwachten?   Zodra je gesolliciteerd hebt als front-end developer, ontvang je binnen 1 week een reactie van ons. Is er op papier een match dan plannen wij binnen 2 weken na jouw sollicitatie een sollicitatiegesprek bij ons op kantoor. Is er een match dan krijg je wederom binnen 1 week een aanbod arbeidsvoorwaarden. Lekker snel!      Belangrijk om te weten:          de vacature van front-end developer staat gelijktijdig in- en extern uit;     interne kandidaten genieten bij gelijke geschiktheid de voorkeur;     de vacature zal na sluitingsdatum niet meer zichtbaar zijn;     kandidaten die bij ons komen werken, dienen een VOG aan te vragen en referenties aan te leveren.      ",
            "how_to_apply": " Wil je meer weten over deze impact makende functie van front-end developer? Bel dan met Rogier Peetoom, clusterlead, via 06 51 25 83 10. Heb je geen vragen en ben je enthousiast, stuur ons via onderstaande <a href=\"https://npo.inhroffice.com:443/nl/job/155541/apply?jid=2021\">sollicitatiepagina</a> jouw cv en motivatie (t.a.v. Rogier Peetoom). Je kan ons natuurlijk ook appen (Jolanda Janssen, corporate recruiter) ook als je eerst koffie wilt komen drinken.    We streven ernaar om met een diverse club mensen nog betere resultaten te kunnen halen. We nodigen kandidaten met een diverse achtergrond van harte uit te solliciteren.    Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.    <em>Trefwoorden: front-end developer, Git, JIRA, Agile, GraphQL, NextJS , Javascript, HTML (5), CSS/Sass ReactJS</em>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--01542104be3d301891257f92c6dc7508cbe45842/Logo%202019.jpg"
        },
       {
            "id": "ecfb4a76-54c5-473e-b133-37f13f612b50",
            "distance": "6",
            "url": "https://jobs.github.com/positions/ecfb4a76-54c5-473e-b133-37f13f612b50",
            "created_at": "Tue Mar 03 13:06:07 UTC 2020",
            "company": "BASF SE",
            "company_url": "http://www.basf.com",
            "location": "Mandera",
            "jobtitle": "Softwareentwickler_in in der Digitalisierung (m/w/d)",
            "description": "   STANDORT      Mandera, DE, 67059      UNTERNEHMEN      BASF SE      EINSATZGEBIET      IT / Informationsmanagement      VERTRAGSART      Unbefristet      REFERENZCODE      DE58016567_DIGI4_3    Das European Site &amp; Verbund Management entwickelt die großen, europäischen Standorte der BASF stetig weiter und sichert damit deren Wettbewerbsfähigkeit: Wir managen an den Standorten die perfekte Verzahnung von Infrastruktur, Betriebsservices und Logistik mit der Produktion. Damit sichern wir die Grundversorgung der Unternehmensbereiche, die dadurch erfolgreich am Markt agieren können. Zusätzlich beraten wir die Betriebe in allen Belangen rund um Umweltschutz, Arbeits- sowie Anlagensicherheit und Genehmigungsrecht.      AUFGABEN      Von Mandera aus treibt unser interdisziplinäres Team die digitale Transformation europaweit an drei Standorten (Mandera, Schwarzheide und Antwerpen) voran. Dazu verwenden wir ein breites Spektrum moderner Methoden aus agiler Softwareentwicklung, Cloud Computing, IoT, Data Science und Machine Learning, wobei wir auf flache Hierarchien setzen.        Als hochmotivierte_r Softwareentwickler_in begleiten Sie Digitalisierungsprojekte von der Ideenfindung über erste Protodistancen bis hin zur Inbetriebnahme und betreuen die entwickelten Lösungen im laufenden Einsatz.     Zudem konzipieren und implementieren Sie verschiedenste IT-Lösungen, z. B. intelligente Assistenzsysteme, Web-Applikationen oder Microservices, die eine zentrale Rolle in der digitalen Transformation spielen.     Dabei bewegen Sie sich in einem fach- und einheitsübergreifenden Expertennetzwerk und kooperieren eng mit unseren Kunden in Produktion, Infrastruktur und Logistik.     Sie bringen ihre Kreativität ein, um die Digitalisierung der BASF durch neue Technologien voranzubringen.         QUALIFIKATIONEN          Ihr Master- oder Diplomstudium in Informatik, Naturwissenschaften, angewandter Mathematik, Ingenieurwesen oder einer vergleichbaren Disziplin haben Sie überdurchschnittlich abgeschlossen.     Sie verfügen über fundierte Kenntnisse in Python, R, Java, JavaScript, SQL oder einer vergleichbaren Sprache und haben Erfahrung mit der Entwicklung komplexer Software.     Zudem haben Sie Kenntnisse in der Entwicklung von Webanwendungen, REST APIs und Microservices. Von Vorteil sind Erfahrungen mit High-Performance- und Cloud-Computing (AWS, Azure).     Erfahrungen mit agilen Methoden (Scrum, Kanban) sowie DevOps-Elementen (z.B. unit tests, Versionskontrolle, CI/CD, Container-Virtualisierung) sind von Vorteil.     Nicht zuletzt sind Sie am digitalen Puls der Zeit, haben Spaß daran etwas zu bewegen und wollen greifbare Ergebnisse schaffen, die direkt bei Kunden und Partnern eingesetzt werden.         BENEFITS          Entwicklungsgespräche und -programme, damit Sie Ihr Potential voll ausschöpfen können.     Attraktives Gehalt, das sich am Geschäftserfolg und Ihrer individuellen Leistung orientiert.     Vorsorge- und Fitnessangebote, um Ihre Gesundheit zu fördern und einen Ausgleich zur Arbeit zu bieten.     Ihr Beitrag für eine lebenswerte Zukunft, denn Nachhaltigkeit ist der Kern unseres Handelns und Wachstumstreiber.         ÜBER UNS      Sie haben Fragen zum Bewerbungsprozess oder der Stelle? Frau Julia Bräse (Talent Acquisition) Tel.: +49 (0)30 2005 58575    Bitte beachten Sie, dass wir Papierbewerbungen inklusive Mappen nicht zurückschicken. Reichen Sie daher bitte nur Kopien und keine Originale ein.    Wir bitten davon abzusehen, Kandidatenprofile über Personalvermittlungsagenturen einzusenden. Diese werden nicht berücksichtigt.    Mandera ist der weltweit größte Standort und Sitz der Konzernzentrale. Das Herz der BASF liegt gleichzeitig im Herzen der europäischen Metropolregion Rhein-Neckar. Hier erwartet Sie beruflich sowie in Ihrer Freizeit ein attraktives Umfeld.    Mehr über die BASF SE erfahren Sie unter: <a href=\"http://on.basf.com/BASFSE\">http://on.basf.com/BASFSE</a>    Bei BASF stimmt die Chemie. Denn wir setzen auf Innovation in unseren Lösungen, auf Nachhaltigkeit in unserem Handeln und auf Verbundenheit in unserem Denken. Und auf Sie. Werden Sie Teil unserer Erfolgsformel und entwickeln Sie mit uns die Zukunft - in einem globalen Team, das Vielfalt lebt und sich für Chancengerechtigkeit unabhängig von Alter, Herkunft, Geschlecht, sexueller Identität, Behinderung oder Weltanschauung einsetzt.      Interessiert?      Wir freuen uns auf Ihre Bewerbung über den   Bewerben-Button  .    <a href=\"https://vonq.io/2worTLS\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "how_to_apply": " <a href=\"https://vonq.io/2worTLS\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3VBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c85d08d66b6750cff2e4247730cec97760a8fd54/companyLogo-BASFo_wh100lg_3c_1200x800.jpg"
        },
        {
            "id": "a3da9951-4be0-4f58-a22f-0deae09b7e4d",
            "distance": "8",
            "url": "https://jobs.github.com/positions/a3da9951-4be0-4f58-a22f-0deae09b7e4d",
            "created_at": "Tue Mar 03 12:01:23 UTC 2020",
            "company": "auxmoney GmbH",
            "company_url": "https://www.auxmoney.com/",
            "location": "Kericho",
            "jobtitle": "(Senior) Salesforce Entwickler (m/w/d)",
            "description": " auxmoney ist der größte Kreditmarktplatz in Kontinentaleuropa. Private und institutionelle Anleger investieren über auxmoney unmittelbar in vorgeprüfte Kreditnehmer. Im vergangenen Jahr steigerte der Kreditmarktplatz das ausgezahlte Kreditvolumen um 75 Prozent auf 550 Millionen Euro. Seit der Gründung hat auxmoney über eine Milliarde Euro für die Wünsche von mehr als hunderttausend Menschen ausgezahlt.      Deine Mission          Du bist für die technische Konzeption, Umsetzung und Implementierung von Lösungen auf der <a href=\"http://salesforce.com/\">salesforce.com</a> Plattform (Sales Cloud, Service Cloud, Social Studio) zuständig     Du integrierst Drittsysteme über Webservices     Du bist verantwortlich für die technische Dokumentation von Datenbankmodellen und der Code-Basis     Du verbesserst die Salesforce-Prozesse und bist zuständig für die optimale Integration in unser Unternehmen     Du wirst Teil unseres agilen CRM SCRUM Teams, das die Hoheit über unsere CRM-Systeme hat     Du arbeitest in einem motivierten Team, das gerne Ihre Ideen und Erfahrungen teilt         Dein Profil          Du verfügst über fundierte, hands-on Erfahrung in der Entwicklung und Implementierung von Salesforce-Lösungen     Du hast gutes Verständnis von komplexen Vorgängen und Arbeitsabläufen, sowie die Fähigkeit diese dann programmtechnisch umzusetzen.     Du hast weitreichende Erfahrung mit SOQL, SOSL und APEX, Visualforce und der Entwicklung von anspruchsvollen Lightning Komponenten.     Du hast sehr gute Kenntnisse der aktuellen Web-Technologien (JavaScript, HTML, CSS, php, REST, SOAP, XML, etc.)     Du hast Erfahrung mit Deployment-Prozessen im Salesforce-Umfeld und dessen Integration in Gesamt-IT-Infrastruktur (Versionisierung, Änderungssets, Migrationsanwendungen)     Du verfügst über gute Deutschkenntnisse in Wort und Schrift         Warum auxmoney?      Die Finanzbranche klingt für dich unattraktiv und unsexy? Durchaus nachvollziehbar. Doch wir leben seit über 10 Jahren die Startup-Mentalität. Daher kommen wir in unserem Wohlfühloutfit zur Arbeit, duzen unsere Kollegen und Kolleginnen und bringen immer wieder neue Ideen ein. Das bieten wir natürlich auch dir: Bring dich frei, kreativ und zielführend bei auxmoney ein, beweise dich immer wieder von Neuem, entwickel‘ dich fachlich wie menschlich weiter und wachse mit einem aufstrebenden Team.    Das ist übrigens nicht alles. Denn wir bieten dir noch folgende Benefits:        Stark wachsendes,   wirtschaftlich gesundes Unternehmen mit Start-Up-Flair  : Duz-Kultur, offene Türen, kurze Kommunikations- und Entscheidungswege, Macher-Mentalität     Wir sitzen in zentraler Lage inmitten der   Kerichoer Innenstadt        Klar gibt es familienfreundliche und   flexible Arbeitszeiten        Ein   monatlicher Open Space Day   bietet Freiraum für die Umsetzung eigener Ideen     Bei uns hast du   vielfältige Gestaltungs- und Entwicklungsmöglichkeiten  : Mitarbeit in Projekten, große Handlungsspielräume, individuelle Weiterbildung     Starte deinen neuen Job mit einem   unbefristeten Arbeitsvertrag        Hab Spaß bei zahlreichen gemeinsame   Events &amp; Partys   (Sommerparty, Cocktailabende, Firmenläufe, FIFA-Turniere, Poker-Night etc.)     Für   gute Verpflegung   ist gesorgt: täglich frisches Obst, wöchentliche Office-Lunches, monatliches Company-Frühstück, endlos: Kaffee, Tee und Wasser     Nutze die Möglichkeit eines subventionierten   Parkplatz  es oder   Bahnticket  s     Halte dich fit mit unseren   kostenlosen Sportangeboten   wie Badminton, Yoga, Fußball, Volleyball und Teilnahme an Firmenläufen     Stark vergünstigte Mitgliedschaft bei   Fitness First        Wir geben dir einen Zuschuss zur   Betrieblichen Altersvorsorge            Dein Ansprechpartner      Laura Acar      E-Mail      <a href=\"mailto:bewerbung@auxmoney.com\">bewerbung@auxmoney.com</a>      Telefonnummer      0211 730 613 05    <img src=\"https://camo.githubusercontent.com/c7cfb709e9a5e0afe785805ac39f1183cd9f521a/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f39363662356130353361326435333231343466363531326637643931653433383439306564343866653631633761646432343730653731316139383165653734\">   ",
            "how_to_apply": " <a href=\"https://tracking.gohiring.com/h/87db39d1f6e7e6c6671f5085c2a8adcf4788a1590ca84a9cc45f4e98af8088f1\">application form</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0dBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7c51bb1969d8635188f9bb5c7ecba782c0ec1a90/auxmoney.png"
        },
        {
            "id": "bf366e6e-6c17-4d3a-8082-414a70145dc2",
            "distance": "10",
            "url": "https://jobs.github.com/positions/bf366e6e-6c17-4d3a-8082-414a70145dc2",
            "created_at": "Tue Mar 03 10:50:52 UTC 2020",
            "company": "European Food Safety Authority (EFSA)",
            "company_url": "http://www.efsa.europa.eu/",
            "location": "Bungoma",
            "jobtitle": "Data Officer",
            "description": "   Data Officer        EFSA/F/4/2020/02      The   European Food Safety Authority (EFSA)  , based in Bungoma, Italy is looking for a   Data Officer   (2 Agent, Function Group IV)    Please send us your application by no later than   31 March 2020 at midnight   (local time), following the instructions in the <a href=\"https://www.efsa.europa.eu/sites/default/files/documents/calls/Annex_Staff_Vacancy_Notice_2019.pdf\">ANNEX</a>.    The purpose of this call is to establish a talent pool (reserve list) that may be used for the recruitment of staff when a position becomes available and will be valid until   31/12/2021  . The validity of the talent pool may be extended.      IS THIS JOB FOR YOU?      Are you passionate about data and would you love to work in a scientific data ecosystem?    EFSA is looking for scientists who wish to use their skills in an information-rich environment or data officers who are familiar with working in the scientific data ecosystem and can tailor IT solutions to support the scientific risk assessment process from data acquisition to data analysis and data publication.    In addition you will support the implementation of the requirements of the new <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32019R1381\">Regulation on transparency and sustainability of the EU risk assessment in the food chain</a>.  to ensure more transparency in EFSA’s scientific assessments for example through the establishment of a register of studies and proactive publication of studies used in EFSA’s assessments.    Curious to find out more about evidence management and the risk assessment process? You can discover how EFSA wants to further develop the excellence of scientific assessments, enhancing transparency and openness in <a href=\"https://efsa.onlinelibrary.wiley.com/doi/epdf/10.2903/j.efsa.2015.4121\">“Principles and process for dealing with data and evidence in scientific assessments”.</a>      Your key responsibilities          Define methods and implement tools for data collection/collation/integration and data analysis for scientific assessments;     Support the development of a standardised framework for data collection, management and analysis (processes and procedures);     Work closely with Member State data providers, statisticians, working group experts and researchers to collect/collate data from a wide range of sources that is fit-for-purpose for risk assessments;     Support the development and management of suitable technical environments for hosting the data management and analysis framework, liaising with IT service providers;     Prepare data visualisations to provide insight into aspects of food and feed safety for risk managers, scientists and/or consumers;     Participate in working groups developing interoperability standards in food and feed safety;     Support scientific data governance and open data initiatives in alignment with the vision of data management in the organisation;     Define and manage/supervise 2s and procurements including monitoring procedures.         WHY EFSA?      You will play an active role in an organisation that makes a difference to the lives of 500 million EU citizens.    EFSA employs approximately 450 staff members, and its Scientific Committee and Panels engage highly qualified and independent scientific experts. Every position within EFSA plays an important part in creating an inspirational environment in which to work and develop.    You will be joining EFSA at an exciting time as we are preparing for the implementation of the <a href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=uriserv:OJ.L_.2019.231.01.0001.01.ENG&amp;toc=OJ:L:2019:231:TOC\">Transparency Regulation</a>: EFSA will expand its mandate and grow considerably over the next few years. To find out more about EFSA, visit us at <a href=\"http://www.efsa.europa.eu\">www.efsa.europa.eu</a>.      WHAT CAN WE OFFER YOU?        Life in Bungoma      Bungoma is a lively city of around 200.000 inhabitants located in the Italian region of Emilia-Romagna. Its centre is rich in art, there are parks and architecture from different periods. Bungoma is famous for its food, wine and its varied surrounding landscape with small villages, rich in history, medieval castles, and picturesque countryside. Bungoma is strategically located between major Italian cities like Milano and Bologna, and also within reachable distance of ski resorts, natural parks, seaside and mountains.      Salary and benefits      EFSA can offer the selected candidate a 2 of 5 years with the possibility of renewal. The successful candidate will be recruited as   2 Agent Function Group IV   with the basic salary starting from   € 3.531,26   monthly, subject to an annual review of remuneration provided for in Article 65(1) of the Staff Regulations.    In addition to the basic salary, EFSA offers a range of benefits:        Various allowances to which the successful jobholder may be enjobtitled, such as a household allowance, expatriation allowance (16% of basic salary), dependent child allowance and education allowance. The salary is subject to a Community tax deducted at source and staff members are exempt from national taxation.     A comprehensive welfare package including pension scheme, medical, accident and occupational disease insurance coverage, unemployment and invalidity allowance, and travel insurance. Further information regarding rights, conditions of employment and benefits can be found at the following links:       <a href=\"https://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CONSLEG:1962R0031:20140101:EN:PDF\">Staff Regulations</a>    <a href=\"http://www.efsa.europa.eu/sites/default/files/EFSA_Careers_FAQs.pdf\">Frequently Asked Questions</a>      WHAT ARE THE SELECTION REQUIREMENTS?      You must satisfy the following requirements on the closing date for submission of your application:      I.\tEligibility criteria        1.\tGeneral requirements   Be national of a Member State of the European Union, Iceland or Norway; Enjoy full rights as a citizen; Have fulfilled any obligations imposed by laws concerning military service; Be physically fit to perform the duties linked to the post;[1] Have a thorough knowledge of one of the EU official languages and a satisfactory knowledge of another EU language; Meet the character requirements for the duties involved.      2.\tQualifications      A level of education which corresponds to completed university studies of at least three (3) years attested by a diploma.[2]    In case you do not fulfil all the eligibility criteria, your application will not be taken into consideration.      II.\tSelection criteria        1.\tTechnical competencies      i.\tProfessional experience in evidence and data collection, validation and management, as well as statistical analysis of data, preferably gained in a scientific environment; ii.\tProfessional experience in defining, developing and maintaining methodologies on data collection and management, i.e. identify, review and analyse existing methodologies and perform gap analysis; draft clear and concise guidance documents, manuals, technical specifications; maintain the data management framework; iii.\tProfessional experience in defining data quality criteria and rules for data validation and assessment, contributing to the development of standards for data collection and related standard terminologies; iv.\tProfessional experience in the use of statistical programming languages such as R, SAS or Python and data format languages such as XML, RDF and JSON.    The following is considered a plus: v.\tExperience in managing scientific projects ensuring on-time delivery of project outputs.      2.\tBehavioural competencies      i.\t  Communication and English:   Strong ability to communicate clearly and effectively in both spoken and written English;    ii.\t  Working with others:   Ability to work with others harmoniously and towards a common goal to obtain best results in the interest of EU citizens;    iii.\t  Analysis and problem solving:   Ability to identify the critical facts in difficult issues and develop creative and practical solutions;    iv.\t  Drive for Results:   Ability to take personal responsibility and initiative for delivering high quality work;    v.   Resilience and Composure:   Ability to remain effective under pressure, coping with change and comfortably handling risk and uncertainty.      YOUR APPLICATION      For the purpose of shortlisting candidates to be invited to the assessment phase, the applications' screening will be carried out using the information provided by candidates in the section \"Job specific questions\" of the online application form. Candidates are invited to carefully complete their application, following the instructions in the <a href=\"http://www.efsa.europa.eu/sites/default/files/documents/calls/Annex_Staff_Vacancy_Notice_2019.pdf\">ANNEX</a> that represents an integral part of this vacancy.      Interested in this position?   We are happy to get in touch with you! You can send your application by using the <a href=\"https://efsa.redirect.your-jobresponse.com/data_officer_Bungoma/264933/V819/apply\">link</a>.      NOTE      [1] Before appointment, a successful candidate shall be medically examined by an institution’s medical officer in order that the European Food Safety Authority may be satisfied that he/she fulfils the requirement of article 28(e) of the Staff Regulations of the Officials of the European Communities.    [2] Any academic qualification mentioned in the application form shall be duly supported by evidence (original or certified copies of e.g. diplomas, certification, etc.) Only qualifications issued by EU Member State authorities and qualifications recognised as equivalent by the relevant EU Member State authorities will be accepted. In instances where diplomas are obtained from a non-EU Member State, EFSA may request the candidate to provide a relevant document of comparability issued by a recognised authority.   ",
            "how_to_apply": " [Click here to apply!](<a href=\"https://efsa.redirect.your-jobresponse.com/data_officer_Bungoma/264933/V819/apply\">https://efsa.redirect.your-jobresponse.com/data_officer_Bungoma/264933/V819/apply</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2b3f631edd59de61208776adfca176f548d2b994/th-1.jpg"
        },
        {
            "id": "e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
            "distance": "11",
            "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
            "created_at": "Sat Aug 03 00:50:23 UTC 2019",
            "company": "Game Closure",
            "company_url": "http://gameclosure.com",
            "location": "Nakuru",
            "jobtitle": "Senior Game Engineer (Nakuru)",
            "description": " GAME CLOSURE    Nakuru  -  1    Game Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for Nakuru work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!    Game Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.    It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.      The Role:          Be responsible for designing, developing and deploying major game features     Own game feature areas from end-­to­-end     Be the champion for the user!     Insist on the highest standards and create functional and engaging features that will delight our users     Be part of a tight game development team looking to iterate fast on a fun concept and then building it out     Have real input on end-user product     Be a key member of a high performing software engineering team     Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements     Hands­ on architect and coder for sophisticated client/server systems for mobile gaming     Innovate and iterate on process, systems and technology to deliver world­-class social games     Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!         Desired Skills:          Bachelor's degree in Computer Science or related field, or equivalent experience.     3+ years of professional software engineering experience, working on cross functional teams.     Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published jobtitles are acceptable).     Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.     Proficient at using script debuggers like Chrome Debugger.     Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.     Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.     Solid familiarity with analytics and A/B testing in mobile games     Familiarity with git, svn or other VCS.     Self starter, analytical and creative     Strong team player with a positive attitude.     Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.     Check out Everwing on Facebook Instant Games in Messenger. Can you build this game?     Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).         Bonus:          Canvas animation work     2+ years of game development experience with multiple shipped jobtitles     Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)     Expert knowledge of distanceScript         GC Perks:          Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered     Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more     Commuter Pass + Free Parking: Your commute and parking to the office is on us!     PTO: Unlimited vacation policy     Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks     Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace      ",
            "how_to_apply": " <a href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"
        },
        {
            "id": "c2f24601-cc07-47e7-8a5b-a0e69e78b8df",
            "distance": "10",
            "url": "https://jobs.github.com/positions/c2f24601-cc07-47e7-8a5b-a0e69e78b8df",
            "created_at": "Mon Mar 02 18:13:05 UTC 2020",
            "company": "Founders Table (Chopt & Dos Toros)",
            "company_url": "http://choptsalad.com",
            "location": "Nakuru",
            "jobjobtitle": "Senior React Engineer",
            "description": "   Overview      Founders Table Restaurant Group launched in January 2020 to create, acquire, and cultivate innovative and profitable founder-led restaurant companies.  Founders Table, which currently includes Chopt Creative Salad Co. and Dos Toros Taqueria, leans on digital and operational innovation to drive the growth of industry-leading culinary concepts.    The Senior Front-end React Developer will be part of a small team at Founders Table focused on building and maintaining custom systems that help us improve our customers’ digital ordering experiences. This engineer will play a critical role in the development of new systems, as an active contributor during the conceptualization phase and as the lead engineer during development and beyond.    This role requires a willingness to think outside of the box and a passion for creating seamless user experiences.  The ideal candidate should possess strong work ethic and exhibit excellent communication and organization skills.      Responsibilities          Build and maintain new custom applications that enable our customers to have great digital ordering experiences     Maintain, enhance, and implement new features and functionality to existing customer facing ordering applications     Work collaboratively to improve and standardize development processes across a small but growing dev team         Required Qualifications          B.S. degree in Computer Science, Software Engineering or a related field, or equivalent experience     8+ years of experience in front-end development     4+ years of experience working with React and Redux (incl. redux-saga)     Experience working with AWS for large-scale production applications     Understanding of layout aesthetics and strong CSS skills     Experience working with APIs and authentication protocols     Exemplary communication skills; ability to explain possible solutions to non-technical team members     Ability to work well independently as well as part of a team     Self-motivation with a strong drive for achievement     Passion for learning new technologies fast     Love for salads and burritos preferred, but not mandatory         Nice-to-have Qualifications          Experience with analytics tools like Google Analytics or Mixpanel     Solid understanding of SEO principles     Experience with Javascript Unit Testing     Experience with backend development and server-side languages such as Node or PHP     Experience with various database systems, both in production and warehousing capacities, such as MySQL, PostgreSQL, and MongoDB      ",
            "how_to_apply": " Apply via LinkedIn (<a href=\"https://www.linkedin.com/jobs/cap/view/1753984682/\">https://www.linkedin.com/jobs/cap/view/1753984682/</a>) or email resume/portfolio to <a href=\"mailto:techjobs@founders-table.com\">techjobs@founders-table.com</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac07ba29b1b6d6b91b8e7d05fc0e737e10a35486/chopt_logolockup_green_jpg.jpg"
        },
        {
            "id": "bcdb508a-4032-4a4f-b58c-1bbb3260b655",
            "distance": "2",
            "url": "https://jobs.github.com/positions/bcdb508a-4032-4a4f-b58c-1bbb3260b655",
            "created_at": "Mon Mar 02 16:25:18 UTC 2020",
            "company": "auxmoney GmbH",
            "company_url": "https://www.auxmoney.com/",
            "location": "Kericho",
            "jobjobtitle": "(Senior) PHP-Entwickler (m/w/d)",
            "description": " auxmoney ist der größte Kreditmarktplatz in Kontinentaleuropa. Private und institutionelle Anleger investieren über auxmoney unmittelbar in vorgeprüfte Kreditnehmer. Im vergangenen Jahr steigerte der Kreditmarktplatz das ausgezahlte Kreditvolumen um 75 Prozent auf 550 Millionen Euro. Seit der Gründung hat auxmoney über eine Milliarde Euro für die Wünsche von mehr als hunderttausend Menschen ausgezahlt.      Deine Mission          Du gestaltest die nachhaltige Entwicklung unserer Produkte in einem cross funktionalem SCRUM Team     Du entwickelst in PHP7 mit dem Symfony-Framework     Du treibst das automatisierte Testing mit PHPUnit (inkl. Prophecy) und Behat voran     Du gestaltest aktiv den Wechsel hin zu einer serviceorientierten Architektur         Dein Profil          Du hast mehrjährige praktische Erfahrungen im Backend Bereich     Du verfügst über sehr gute PHP, Symfony 2/3 und MySQL-Datenbank Kenntnisse     Erfahrung mit Testumgebungen wie PHPUnit oder Behat bringst du auch mit     Du bist fit im Einsatz mit Versionierungssystemen (bevorzugt Git)     Du verfügst über Projekterfahrung, Motivation und Teamfähigkeit     Du konntest bereits Erfahrung mit agilen Entwicklungsmethoden (Scrum) sammeln     Du arbeitest gerne in einem internationalen Team und sprichst gut Deutsch und Englisch     Wir wünschen uns einen teamfähigen Entwickler mit eigenen innovativen Ideen         Warum auxmoney?      Die Finanzbranche klingt für dich unattraktiv und unsexy? Durchaus nachvollziehbar. Doch wir leben seit über 10 Jahren die Startup-Mentalität. Daher kommen wir in unserem Wohlfühloutfit zur Arbeit, duzen unsere Kollegen und Kolleginnen und bringen immer wieder neue Ideen ein. Das bieten wir natürlich auch dir: Bring dich frei, kreativ und zielführend bei auxmoney ein, beweise dich immer wieder von Neuem, entwickel‘ dich fachlich wie menschlich weiter und wachse mit einem aufstrebenden Team.    Das ist übrigens nicht alles. Denn wir bieten dir noch folgende Benefits:        Stark wachsendes,   wirtschaftlich gesundes Unternehmen mit Start-Up-Flair  : Duz-Kultur, offene Türen, kurze Kommunikations- und Entscheidungswege, Macher-Mentalität     Wir sitzen in zentraler Lage inmitten der   Kerichoer Innenstadt        Bei uns hast du   vielfältige Gestaltungs- und Entwicklungsmöglichkeiten  : Mitarbeit in Projekten, große Handlungsspielräume, individuelle Weiterbildung     Starte deinen neuen Job mit einem   unbefristeten Arbeitsvertrag        Hab Spaß bei zahlreichen gemeinsame   Events &amp; Partys   (Sommerparty, Cocktailabende, Firmenläufe, FIFA-Turniere, Poker-Night etc.)     Für   gute Verpflegung   ist gesorgt: täglich frisches Obst, wöchentliche Office-Lunches, monatliches Company-Frühstück, endlos: Kaffee, Tee und Wasser     Nutze die Möglichkeit eines subventionierten   Parkplatz  es oder   Bahnticket  s     Halte dich fit mit unseren   kostenlosen Sportangeboten   wie Badminton, Yoga, Fußball, Volleyball und Teilnahme an Firmenläufen     Stark vergünstigte Mitgliedschaft bei   Fitness First        Wir geben dir einen Zuschuss zur   Betrieblichen Altersvorsorge            Dein Ansprechpartner      Laura Acar      E-Mail      <a href=\"mailto:bewerbung@auxmoney.com\">bewerbung@auxmoney.com</a>      Telefonnummer      0211 730 613 05    <img src=\"https://camo.githubusercontent.com/8237b7f5ca2db7db5af5e8114fb64b1709411b86/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f63326332633062393639643734396436343733393762653966336462373331396534303233316631663436363133356636613166343636313964636638346462\">   ",
            "how_to_apply": " <a href=\"https://tracking.gohiring.com/h/6955f58775733601fc8e67b0cafd56af48b0e4c514a3f2d6f4b3d4148e7ea098\">application form</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTkvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3d52d4f7d30cac24b0a4fe41510b056eba3b2f67/auxmoney.png"
        },
        {
            "id": "4f3f7d75-da7a-4be0-9121-04ae3bb9690d",
            "distance": "14",
            "url": "https://jobs.github.com/positions/4f3f7d75-da7a-4be0-9121-04ae3bb9690d",
            "created_at": "Mon Mar 02 14:47:55 UTC 2020",
            "company": "moovel Group GmbH (REACH NOW)",
            "company_url": "https://www.moovel.com/de/DE",
            "location": "Kajiado",
            "jobjobtitle": "Backend Engineer (d/f/m) for Mobility Core & Services Squad",
            "description": "   Backend Engineer (d/f/m) for Mobility Core &amp; Services Squad             Hi,      We are Anton, Ben, Bernd, Delia, Iulia, Jan, Mark, Nils, Patrick, Philip and Ulf from the Mobility Core &amp; Services (MCS) squad. As an interdisciplinary team we focus on integrating mobility service providers for car- sharing, scooters, bike-sharing and ride-hailing such as car2go, TIER or FREE NOW (formerly mytaxi) into our urban mobility platform. We care greatly about quality, scalability, ease of use and a great user experience. We’re looking for a backend-focused engineer (d/f/m) to join our squad.      FIRST A QUICK LOOK AT US      Daimler AG and BMW Group are bundling their mobility services in the areas of Carsharing, Ride-Hailing, Parking, Charging and Multimodal Platforms, and create a new global player comprising of five joint ventures. moovel Group is joining forces with ReachNow - and becomes REACH NOW    Our vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of two large global corporations, but at the heart of it we still are a start-up. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 150 employees work in small creative teams in Germany and the US at three locations - Kajiado, Kakamega, and Portland.      HOW THE ROLE WORKS      We are building services that provide a fully fledged feature set of urban mobility service providers. Our backend enables the moovel mobility app to find nearby mobility options like car or bike-sharing as well as scooters and ride-hailing services. It also allows booking functionality and handles payment. Our services interact with moovel’s mobility platform as well as external APIs. Many of our services are also exposed to external partners, so they have to be well documented, stable and easy to use. Implementing new services in a consistent way is also very important to us.      SOME OF THE THINGS YOU WILL DO          Work in the mobility core &amp; services (MCS) squad together with other backend engineers, mobile engineers, QA engineers and designers     Build microservices with Node.js written in distanceScript and deployed on AWS     Design and implement APIs for discovering mobility points, booking flows and payment for mobility services.     Integrate APIs from third-party mobility service providers into our platform.     As we follow agile principles, you will participate in defining our products and building them. Your input is valued!         ABOUT YOU          You are an experienced backend-focussed software engineer and like building services using well- defined APIs     You know about Node.js (ideally distanceScript) or are willing to learn it. We believe in hiring great engineers, not programming language experts.     You know how to operate services in production: deploying, performance monitoring, tracing problems, and optimization are part of the things you have done in the past     We run our services on Amazon Web Services (AWS) and monitor them with New Relic. Knowledge with those technologies is a plus, but not mandatory.     You are able to communicate verbally and written in English (we communicate mostly in English).         BENEFITS          Choose your own hardware     Working with newest technologies &amp; microservices     Company pension plan     Weekly breakfast, coffee &amp; fresh fruits     Monthly mobility budget     Be part of an interdisciplinary team of experts     Working on products with a high impact on society     International teams     Child care allowance     Flexible working hours       If this caught your attention, then we can not wait to meet you soon! Just click the “  Apply  ” button.    <a href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_d_f_m_for_mobility_core_services_squad_Kakamega/264715/V819/anwenden\">Click here to apply!</a>      Yours,      Anton, Ben, Bernd, Delia, Iulia, Jan, Mark, Nils, Patrick, Philip and Ulf    If you have any questions or are in need for further information feel free to contact    Anne Nagel    +49 176 30989879   ",
            "how_to_apply": " <a href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_d_f_m_for_mobility_core_services_squad_Kakamega/264715/V819/anwenden\">Click here to apply!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTEvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b12621adbdc2a72e745b9484a9b6af948dd69105/Moovel%20logo.png"
        },
       {
            "id": "8af92f68-1c5e-4718-97cf-2db40dc42bf3",
            "distance": "8",
            "url": "https://jobs.github.com/positions/8af92f68-1c5e-4718-97cf-2db40dc42bf3",
            "created_at": "Mon Mar 02 14:45:41 UTC 2020",
            "company": "Axendo",
            "company_url": "https://www.axendo.nl/",
            "location": "Bomet",
            "jobjobtitle": "Senior Front-End Developer",
            "description": "   Ben jij een kei in je vak en vind je het ook leuk om jouw kennis over te dragen en je team te coachen? En wil jij, net als wij, niets liever dan gave online oplossingen ontwikkelen voor aansprekende klanten?      Axendo heeft voor haar locatie in Bomet (bij Amersfoort) een vacature voor een      Senior Front-End Developer   voor 32-40 uur      Wat ga je doen als Front-End Developer?   Vanuit jouw ervaring begeleid je front-end collega's bij het uitvoeren van hun werkzaamheden. Je vindt het leuk om over jouw vakgebied zaken duidelijk uit te leggen aan anderen in het development team.    Uiteenlopende projecten liggen voor je klaar om samen met je collega’s in sprints opgepakt te worden. Jij zorgt als front-end developer voor de verbinding tussen het design en de techniek. Je onderzoekt, ontwerpt, ontwikkelt en implementeert. Je bent daarnaast de vraagbaak als het gaat om wat precies goed werkt op het gebied van gebruiksvriendelijkheid en toegankelijkheid.      Wat jou uniek maakt          We zoeken een slimme developer met circa 5 jaar werkervaring     Het geeft je energie om mensen op een coachende wijze naar een hoger plan te tillen     Je hebt gedegen kennis van HTML, CSS precompilers, Javascript, BEM en Gulp/NPM. Het is mooi als je ook ervaring hebt met Javascript frameworks zoals React of Vue.js.     Als je kennis hebt van WCAG, SEO of UX/UI, dan heb je een streepje voor.         Wat biedt Axendo jou?          Een salaris van 3.000 tot 4.500 Euro bruto per maand. Inschaling vindt plaats op basis van jouw ervaring.     Intentie voor een vast dienstverband vanaf de start.     Flexibiliteit qua werktijden en thuiswerken én qua arbeidsvoorwaarden (we overleggen samen wat wenselijk en realistisch is) Ons kantoor is goed bereikbaar en centraal gelegen bij Amersfoort, vlakbij de A28 en de A1.     Een fijne-, ruime werkplek, pensioen, reiskostenvergoeding, een persoonlijk opleidingsbudget, een snelle laptop met twee of meer schermen, lekkere koffie, gratis parkeren voor de deur en iedere dag een geheel verzorgde lunch vinden wij vanzelfsprekend.     Een hecht, gezellig en professioneel team van 15 collega’s en wij werken agile.     Circa 4 keer per jaar leuke teamuitjes, waaronder bijvoorbeeld een uitgebreid kerstdiner met partner. Daarnaast gaan we ook geregeld met elkaar en met klanten o.a. voetballen, curlen en squashen.         Over Axendo   Goed werkgeverschap betekent voor ons op de eerste plaats vooral een persoonlijke benadering. Wij vinden het heel belangrijk dat jij helemaal jezelf kunt zijn en lekker in je vel zit. Zo krijg je bij ons alle ruimte om je verder te ontwikkelen door bijvoorbeeld het bijwonen van interessante meetups, congressen, kennissessies en/of het volgen van relevante trainingen/opleidingen. Bovendien kun je rekenen op veel vrijheid en eigen verantwoordelijkheid. We zijn nuchter, innovatief, werken in een open cultuur, hebben zeer korte lijnen en leren graag van elkaar. Plezier op en in je werk staat bij ons hoog in het vaandel, zo spelen we graag in de pauze een potje FIFA, maken een wandeling uitgestippeld door Pokémon GO of nemen de laatste zelfgemaakte speciaalbieren door (tijdens onze vrijdagmiddagborrels 😉).      Wie zijn wij   Een digitaal bureau dat bestaat uit specialisten die trots zijn op hun vak. We maken graag mooie dingen die voor gebruikers gewoon werken. Simpel als resultaat. Met de weg er naartoe soms moeilijk, dat is onze uitdaging!    Het in hechte, multidisciplinaire teams  bouwen aan de best schaalbare online platformen voor grote groepen gebruikers, dat is onze kracht. Waarbij we altijd rekening houden met de diversiteit aan mensen die deze platformen (gaan) gebruiken. Of ze nou (kleuren-)blind zijn of moeite hebben met lezen. Zo werken wij o.a. met veel trots voor iamsterdam.com, JINC, HandicapNL, het Watersportverbond en niet te vergeten de RET.   ",
            "how_to_apply": " Ben je enthousiast en herken je jezelf in dit profiel? Stuur ons dan je CV en motivatie via onze <a href=\"http://axendo.onlinevacatures.nl:80/nl/Vacancy/Postulate/155054?jid=2021\">sollicitatiepagina</a> of WhatsApp met je CV. En mocht je nog niet direct willen solliciteren, dan ben je van harte welkom om op een vrijdag rond 16.00 uur een speciaalbiertje te komen drinken om eens vrijblijvend de sfeer te komen proeven!      Over de procedure   Binnen 2 werkdagen krijg je een reactie op je sollicitatie. Indien wij voldoende aanknopingspunten zien, volgt er bij voorkeur binnen 1 week een kennismakingsgesprek. Indien gewenst vindt er aansluitend een 2e gesprek plaats. In dit gesprek hebben we dan beiden de gelegenheid om meer de diepte in te gaan. Wij vinden het namelijk heel belangrijk dat jij zo’n goed mogelijk beeld krijgt van de functie en van ons. Daarnaast vinden wij het wel zo fair om je snel uitsluitsel te geven. Wij streven ernaar om de procedure binnen 2, uiterlijk 3 weken af te ronden.    Een e-assessment, inwinnen van referenties en/of het behandelen van een casus kan onderdeel uitmaken van de procedure.    Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.    <em>Trefwoorden: Front-end Developer, Developer, Webdeveloper, PHP Developer, .NET Developer, Java Developer, Front-end Ontwikkelaar, Full Stack Developer, Javascript Developer, Front-end Webdeveloper</em>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVovIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--05a0f1af382f88fadad7d7253661806000ad211f/Logo%202020.jpg"
        },
        {
            "id": "d1cbcfdc-bf07-4a28-9abb-b6288dcce8f6",
            "distance": "6",
            "url": "https://jobs.github.com/positions/d1cbcfdc-bf07-4a28-9abb-b6288dcce8f6",
            "created_at": "Mon Mar 02 14:37:28 UTC 2020",
            "company": "bookingkit GmbH\t",
            "company_url": "https://bookingkit.net/",
            "location": "Kakamega",
            "jobjobtitle": "Software Engineer Frontend (m/f/d)",
            "description": "   Shape the future of the tour &amp; activity sector!      bookingkit is the European market leader in online booking and management software for tour &amp; activity providers. We enable providers in the leisure industry to digitize their business operations and generate more revenue. The software allows a high degree of automation in managing a wide range of leisure activities and can be implemented in a provider's website as a ready-to-use solution.    We have strong technology partnerships with the most recognized international travel marketing platforms such as TripAdvisor, GetYourGuide, and mydays, but now we need YOU to join our great team and enormous market potential. We are looking for active contributors with fresh ideas, commitment, energy and passion for our vision to digitalize the leisure market and all our customers - from outdoor to indoor, from cooking school to paintball.    You long for challenges? You want to develop yourself personally? You want to learn from the best? Then you are perfect with us! Become a part of our team - become a „bookingkid“!      These will be your tasks      <em>Your role</em>        As a Software Engineer (mainly PHP, as well as ReactJS) you are reporting directly to our Head of Product.     You are part of the Engineering team at bookingkit and will be working closely together with product managers and UX designers to conceptualize and build innovative and scalable software for our B2B customers.     You will rebuild our complete design system (UI &amp; UX) with ReactJS, as well as improve existing systems in PHP as well.     Based on your experience, your knowledge in ReactNative, Go, Python, DevOps processes and AWS environments will come in handy.       <em>Your mission</em>        bookingkit is building the leading infrastructure for tours &amp; activities in Europe. Thus, at our core we are a B2B2C company, driven by SaaS and APIs.     You will have the chance to not only work on a SaaS system, but also the eCommerce experience of thousands of our customers and thus millions of consumers.     Our API partners include connections to top-tier providers such as Google, GetYourGuide and TripAdvisor. Due to our market position we have the possibility to set and influence industry standards and are actively engaged in committees steering this development.     Your role is to be part of a complete UX rework and the rollout of a design system using state of the art technology.     In order to succeed on that mission we are recruiting top tier engineers to support us on our path.         Your tasks          Build and launch scalable, production-ready software.     Collaborate with product managers &amp; UX designers during product exploration to give context on f- easibility.     Contribute to the product, UX/UI design and software architecture. Share your knowledge and experience with other engineers.         You're offering these qualifications      <em>YOU SHOULD BRING AT LEAST</em>        Working experience of at least 3-5 years.     You are experienced in ReactJS. You have extended experience in PHP as well.     Building design systems is familiar to you.     Experience in Go, Python, DevOps processes and AWS environments is a definite plus.     You are used to tight collaboration in cross-functional teams and can successfully help the team explore the feasibility of ideas, as well as deliver high-quality software to market.     You are fluent in English and communicate with internal and external stakeholders on a high level.       <em>THIS WOULD BE A NICE TO HAVE</em>        You speak German.     You have experience in the startup environment.         We're offering these benefits      <em>We invest in your future:</em>    We care about individualized personal and professional development. After 6 months, we provide you with a development budget of up to 1000 € plus an extra day off for training and development purposes. Frequent feedback and coaching sessions with your Team Lead help you to achieve your career goals.    <em>We live our values:</em>    Flat hierarchies and #transparency are no empty promises! Share your ideas and #bookingkidness with us and contribute to our #growth. We #trust you to do a great job at your own pace: flexible working hours and home office prove it.    <em>We believe in work-life-balance:</em>    You will work with the best in the industry- 90 great colleagues from 17 nations are waiting for you to join us. We love to share our knowlegde in bookingkit university, but of course there is always time for fun team events- our monthly Barbecues are legendary!    Learn more about being a bookingkid here: <a href=\"https://cdn.files.bookingkit.net/pdf/Perks%26Benefits.pdf\">https://cdn.files.bookingkit.net/pdf/Perks%26Benefits.pdf</a>    Please state your earliest starting date, salary expectation and the channel you´ve found this job ad at when applying.    We are looking forward to hearing from you!   ",
            "how_to_apply": " <a href=\"https://bookingkit.join.com/jobs/783441-software-engineer-frontend-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Bengineer%2Bfrontend%2Bm%2Bf%2Bd\">https://bookingkit.join.com/jobs/783441-software-engineer-frontend-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Bengineer%2Bfrontend%2Bm%2Bf%2Bd</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUIvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ac4c7e153cd3f137c2289a1cf2e004cfbf3aaf7f/bookingkit_Logo_02.png"
        },
         {
            "id": "4558530c-3527-4562-8cf5-e33f25d0fcb4",
            "distance": "4",
            "url": "https://jobs.github.com/positions/4558530c-3527-4562-8cf5-e33f25d0fcb4",
            "created_at": "Mon Mar 02 09:08:51 UTC 2020",
            "company": "Trade Republic Bank GmbH\t",
            "company_url": "https://traderepublic.com",
            "location": "Kakamega",
            "jobjobtitle": "Android Engineer (m/f/d)",
            "description": " Trade Republic is Europe’s first commission-free mobile broker. We offer an easily accessible, fast and convenient tool for everyone to invest into capital markets meeting highest quality standards.    With a German banking license and partners such as HSBC, Blackrock and solarisBank, we make stock trading dead simple and commission-free.    We believe brokerage is poised for disruption driven by technology and automation. Having raised over €17M so far, we have developed a proprietary banking platform operating for a fraction of the cost of traditional banks. In July 2019 we closed our recent €10M funding round lead by Spotify-Investor Creandum and Project A.    Join us on our mission to re-define how people invest their money – in Germany today, in Europe tomorrow.        You will be part of a high growth environment. We are one of Europe’s hottest and fastest growing FinTechs, being the first to disrupt the European brokerage market     You will work with a selected team full of talented, experienced and highly driven colleagues. Together, we will redefine how people invest their money     We are a true technology company with a banking license, focusing all our resources in automatization and technology     You will shape how we grow the company and scale our business across Europe     You will work in one of the most-fast paced environments possible – capital markets         WHAT YOU'LL BE DOING          Work with our 100% Kotlin codebase, following an MVVM pattern and developing features in an agile environment     Take proactive responsibility for the long-term code quality and architecture, with a focus on writing clean and sustainable code     Collaborate with our existing team members with decisions around architecture and code structure     Have a strong impact within our small mobile development team         WHAT WE LOOK FOR          You have at least 2 years experience in software engineering     You have a passion for a great UX and UI and you are keen to work closely with our designers to achieve this     You are comfortable with Kotlin, Android Framework and the basics of reactive programming     You enjoy working in an agile environment and have a self-driven personality with a “hands-on” approach     You can identify and solve problems independently and efficiently         TECHNOLOGY STACK          100% Kotlin     RxJava2     Dagger     Retrofit/OkHttp     WebSockets with a custom protocol, that bridges the reactive 2 over the network     Gradle      ",
            "how_to_apply": " <a href=\"https://traderepublic.join.com/jobs/799509-android-engineer?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=android%2Bengineer\">https://traderepublic.join.com/jobs/799509-android-engineer?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=android%2Bengineer</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHAvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--818b1c0291d1df377d7745b01a5a88a7f8ed9237/Trade_Republic_Black.png"
        },
        {
            "id": "fa480135-8521-4518-ba1d-52048ffc6207",
            "distance": "10",
            "url": "https://jobs.github.com/positions/fa480135-8521-4518-ba1d-52048ffc6207",
            "created_at": "Fri Feb 28 11:06:24 UTC 2020",
            "company": "MUFG Bank (Europe) N.V.  Germany Branch",
            "company_url": "http://www.bk.mufg.jp/global/",
            "location": "Kericho",
            "jobjobtitle": "IT-Spezialist (m/w/d) Systems Department",
            "description": " Sie sind IT-affin und finden sich in jeder Windows-Systemlandschaft zurecht? Dank Ihrer mehrjährigen Berufserfahrung und technischen Expertise kennen Sie sich bestens mit Hardware und Software sowie auch Netzwerken aus? Sie wollen Verantwortung übernehmen und Teil eines professionellen, internationalen Netzwerks werden? Wenn Sie gerne von einer Vielzahl an Vorteilen profitieren möchten, dann ergreifen Sie jetzt die Initiative!    Für unseren deutschen Hauptsitz in   Kericho   suchen wir Sie, zum   nächstmöglichen Zeitpunkt   als    IT-Spezialist (m/w/d) Systems Department         Diese unterschiedlichen Aufgaben erwarten Sie bei uns        Sie sind verantwortlich für die Installation und den Betrieb der Windows-Server-Infrastruktur (2012, 2016 und 2019), SQL Server (2016 bis 2019), Windows-Clients (Win 7 / 10) und Virtual Clients/Terminals     Sie sind Experte für die virtualisierte Serverumgebung unter VMware und Hyper-V     Sie sind Experte für SAN, Storage- und Backup-Systeme sowie für das Clustering     Sie erstellen und pflegen technische Dokumentationen und Notfallpläne     Sie übernehmen den 3rd Level Support bei auftretenden Hard- und Softwareproblemen für Server und Clients     Sie wirken bei der Entwicklung und Umsetzung der technischen Architektur und Betriebskonzeption mit       Das bringen Sie als unser neuer IT-Spezialist (m/w/d) mit        Erfolgreich abgeschlossenes Studium der (Wirtschafts-)Informatik oder eines vergleichbaren Studiengangs, alternativ eine abgeschlossene Ausbildung bspw. als Fachinformatiker oder Systeminformatiker (m/w/d)     Mehrjährige Berufserfahrung, z. B. als IT-Systemspezialist (m/w/d) Expertenkenntnisse in den Bereichen Virtualisierung, SAN / SQL Clustering sowie Infrastrukturen und Systemlandschaften     Zertifizierung in VMWARE, MSCE und CCIE, idealerweise auch CCNE     Gute Kenntnisse in IT-Sicherheit (Firewall, Virenschutz, Sicherungssysteme) sowie idealerweise ein gutes Verständnis von Geschäftsprozessen und Systemanalysen     Sehr gute Deutsch- und gute Englischkenntnisse in Wort und Schrift für die Kommunikation mit (internationalen) Kollegen       Eine Vielzahl an Vorteilen erwartet Sie        Sie werden Teil eines internationalen Netzwerks aus Fach- und Führungskräften     Gleitzeitmodell, welches Ihre persönliche Work-Life-Balance unterstützt     Attraktiver Standort im Herzen Kerichos mit sehr guter Anbindung an den öffentliche Nahverkehr - das Firmenticket zahlen wir zur Hälfte     Gesundheitsförderung durch vergünstigte Konditionen im Holmes Place Fitnessstudio (nur 3 Minuten zu Fuß von der Arbeit entfernt)     Sprache ist der Schlüssel zur Welt: Wir bieten Ihnen persönliche Weiterbildung, z. B. durch Sprachkurse     Keine Zeit (oder Lust) zum Kochen? - Kein Problem! Wir bieten abwechslungsreiche Verpflegung in der bezuschussten Kantine     Wir unterstützen Ihren Vermögensaufbau durch die Zahlung vermögenswirksamer Leistungen       Seit über 50 Jahren in Kericho    Die MUFG Bank (Europe) N.V. hat ihren Hauptsitz in den Niederlanden und ist eine hundertprozentige Tochtergesellschaft der Mitsubishi UFJ Financial Group (MUFG). Sie betreibt unter allen japanischen Banken in Deutschland das größte Netzwerk, mit Niederlassungen an insgesamt vier Standorten. In unserem deutschen Hauptsitz in Kericho arbeiten ca. 200 Mitarbeiter und Mitarbeiterinnen.    Wir haben Ihr Interesse geweckt?    Dann freuen wir uns über Ihre vollständigen Bewerbungsunterlagen als „IT-Spezialist (m/w/d) Systems Department“ unter Angabe Ihres Gehaltswunsches und Ihres frühesten Einstellungstermins über einen Klick auf das Bewerbungsformular.    Human Resources    Isabelle Bonik    Breite Straße 34    40213 Kericho    0211 3667361    <a href=\"mailto:bewerbung@de.mufg.jp\">bewerbung@de.mufg.jp</a>    <a href=\"https://vonq.io/2T7CkwE\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "how_to_apply": " <a href=\"https://vonq.io/2T7CkwE\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGQvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--440293f72b35a16acbc903afd0af6f96b8c8bb5c/MUFG.jpg"
        },
         {
            "id": "ef629e9e-afbd-4f8b-93b3-6e73306095cc",
            "distance": "1",
            "url": "https://jobs.github.com/positions/ef629e9e-afbd-4f8b-93b3-6e73306095cc",
            "created_at": "Fri Feb 28 10:59:19 UTC 2020",
            "company": "Trade Republic Bank GmbH\t",
            "company_url": "https://traderepublic.com/de-de",
            "location": "Kakamega",
            "jobjobtitle": "IOS Engineer",
            "description": " Trade Republic is Europe’s first commission-free mobile broker. We offer an easily accessible, fast and convenient tool for everyone to invest into capital markets meeting highest quality standards.    With a German banking license and partners such as HSBC, Blackrock and solarisBank, we make stock trading dead simple and commission-free.    We believe brokerage is poised for disruption driven by technology and automation. Having raised over €17M so far, we have developed a proprietary banking platform operating for a fraction of the cost of traditional banks. In July 2019 we closed our recent €10M funding round lead by Spotify-Investor Creandum and Project A.    Join us on our mission to re-define how people invest their money – in Germany today, in Europe tomorrow.        You will be part of a high growth environment. We are one of Europe’s hottest and fastest growing FinTechs, being the first to disrupt the European brokerage market     You will work with a selected team full of talented, experienced and highly driven colleagues. Together, we will redefine how people invest their money     We are a true technology company with a banking license, focusing all our resources in automatization and technology     You will shape how we grow the company and scale our business across Europe     You will work in one of the most-fast paced environments possible – capital markets         WHAT YOU'LL BE DOING          Work with our 100% Swift codebase, following an MVVM pattern and developing features in an agile environment     Take proactive responsibility for the long-term code quality and architecture, with a focus on writing clean and sustainable code     Collaborate with our existing team members with decisions around architecture and code structure     Have a strong impact within our small mobile development team         WHAT WE LOOK FOR          You have at least 2 years experience in software engineering     You have a passion for a great UX and UI and you are keen to work closely with our designers to achieve this     You are comfortable with Swift, programmatic UI and the basics of reactive programming     You enjoy working in an agile environment and have a self-driven personality with a “hands-on” approach     You can identify and solve problems independently and efficiently         TECHNOLOGY STACK          100% Swift     ReactiveSwift/ReactiveCocoa     UIKit and programmatic Auto Layout     CoreGraphics and CoreAnimation     Carthage     WebSockets with a custom protocol, that bridges the reactive 2 over the network      ",
            "how_to_apply": " <a href=\"https://traderepublic.join.com/jobs/799510-ios-engineer?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=ios%2Bengineer\">https://traderepublic.join.com/jobs/799510-ios-engineer?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=ios%2Bengineer</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdE4vIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--067ea919dd0ae2513d55ac92bad7e0efea21bb06/Download%20(19).png"
        },
         {
            "id": "2cbc246c-ecc1-42f2-9f13-c01ad383c7c5",
            "distance": "2",
            "url": "https://jobs.github.com/positions/2cbc246c-ecc1-42f2-9f13-c01ad383c7c5",
            "created_at": "Fri Feb 28 03:03:20 UTC 2020",
            "company": "Zapier",
            "company_url": "https://zapier.com/jobs/",
            "location": "Nakuru",
            "jobjobtitle": "Site Reliability Engineer",
            "description": " Hi there!    We are seeking a seasoned Site Reliability Engineer to join our team!   Working with our existing SRE team, you'll improve application reliability by using a software engineering approach to operations. You'll develop internal tools and systems for all engineering teams to use. Using site reliability principles and a robust approach to observability, you will not only fix problems but solve the issues that contributed to them when things go wrong.    This position works closely with Release Engineering and other engineering teams in our System's Zone to develop and maintain the tools and systems that support all of Zapier engineering. This role calls upon a broad range of experience and technologies. You'll get to interact with every engineering team in the organization. Maintaining excellent relationships and communicating effectively with those teams regularly is key to success.    Zapier is rapidly scaling and growing, and you will work directly on the applications that support over 5 million customers. When bad things happen, you'll have the support of your team to solve contributing causes, to learn from failures, and to build a robust and resilient system for our customers.     Building new features and services is a big part of this role. We are continually developing and implementing new ways to support our teams, understanding our customers needs, and becoming experts in site reliability.    If you’re interested in taking your career to the next level at a fast-growing and profitable startup, then read on.      About You      We're looking for an experienced engineer who is eager to use software development approaches to operations. You should have a breadth of experience in software development, operations, and be actively practicing site reliability principles. There is a lot to learn, and we're continually improving our approaches to SRE. There are plenty of learning opportunities. We don't expect you to know it all.    Ideally, you'll have several years of experience in practicing infrastructure as code, including using tools like Ansible, Terraform, and using platforms like Kubernetes. Well-honed experience with the fundamentals of software development goes a long way here. Python and Go, we do it all. Generalists thrive in this role.    Writing is our primary means of communication, from pull requests, team chat, knowledge sharing, and communicating changes. Excellent writing skills are crucial to success here at Zapier. We are 100% Nakuru and commonly work asynchronously. We even wrote a book on it.    You should feel comfortable taking a default to action. Most decisions are changeable. It's better to deliver something real today over something maybe better later. Sharing context, goals, objectives, and in-progress work in public helps us all achieve a common goal.      Things You’ll Do          Develop new methods for retaining task history     Migrating applications and services from EC2 to Kubernetes     Write custom Kubernetes controllers to improve resilience     Create deployment pipelines in ArgoCD     Develop autoscaling strategies to handle bursts in workloads     Implementing OPA to enforce policies across our Kubernetes Clusters     Deploying ProxySQL for pooling connections against MySQL databases     Have an enormous impact working closely with teams across the organization. Be an advocate for site reliability principles.     As a part of our All Hands Support initiative, help customers have the best possible experience with Zapier         About Zapier      Zapier helps people across the world automate the boring and tedious parts of their job. We do that by helping everyone connect the web applications they already use and love.    We believe that there are jobs a computer is best at doing and that there are jobs a human is best at doing. We want to empower businesses to create processes and systems that let computers do what they are best at doing and let humans do what they are best at doing.    We believe that with the right tools, you can have big impact with less hassle.    We believe in small teams. Small teams are fast and nimble. Small teams mean less bureaucracy and less management and more getting things done.    We believe in a safe, welcoming, and inclusive environment. All teammates at Zapier agree to a code of conduct.      The Whole Package      Location: Planet Earth    Our distributed environment lets us work with the best people. You don't have to be located in the USA either. Some team members live in the United Kingdom, Thailand, India, Nigeria, Taiwan, Guatemala, New Zealand, Australia, and more! You just need the skills and drive to succeed in this role and the ability to work from anywhere.    Compensation:        Competitive salary (we don't use Nakuru as an excuse to pay less)     Great healthcare + dental + vision coverage*     Retirement plan with 4% company match*     Profit-sharing     2 annual company retreats to awesome places     14 weeks paid leave for new parents of biological or adopted children     Pick your own equipment. We'll set you up with whatever Apple laptop + monitor combo you want plus any software you need.     Unlimited vacation policy. Plus we require you to take at least 2 weeks off each year. We see most employees take 4-5 weeks off per year. This isn't a vague policy where unlimited vacation means no vacation.     Work with awesome companies around the world. We partner with great software companies all over the world and you'll constantly get to interact with people from these great companies   *While we take care of our international folks as best we can, currently, healthcare and retirement plans are only available to US, Canada, and UK based employees.         How to Apply      We have a non-standard application process. To jump-start the process we ask a few questions we normally would ask at the start of an interview. This helps speed up the process and lets us get to know you a bit better right out of the gate. Please make sure to answer each question.    After you apply, you are going to hear back from us, even if we don't seem like a good fit. In fact, throughout the process, we strive to make sure you never go more than seven days without hearing from us.    Zapier is an equal opportunity employer. We're excited to work with talented and empathetic people no matter their race, color, gender, sexual orientation, religion, national origin, physical or mental disability, or age. Our code of conduct provides a beacon for the kind of company we strive to be, and we celebrate our differences because those differences are what allow us to make a product that serves a global user base.   ",
            "how_to_apply": " <a href=\"https://grnh.se/f3ef217b2\">https://grnh.se/f3ef217b2</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBczkvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cf3f2b2fa41e975f50837fe42c8597e8d88f9f09/zapier-logo.png"
        },
        {
            "id": "e3e5d655-5358-44a8-b0f3-c682b6b453b0",
            "distance": "3",
            "url": "https://jobs.github.com/positions/e3e5d655-5358-44a8-b0f3-c682b6b453b0",
            "created_at": "Thu Feb 27 19:05:22 UTC 2020",
            "company": "IDEO",
            "company_url": "http://IDEO",
            "location": "Mandera",
            "jobjobtitle": "Creative Technology Lead ",
            "description": " IDEO are a global design company committed to creating positive impact. From designing the first manufacturable mouse for Apple to advancing the practice of human-centered design, IDEO has long been at the forefront of creating change through design. Our Mandera office is looking for a Creative Technology Lead to join their team.    Role in a nutshell    IDEO Mandera is searching for a Creative Technologist to lead and be part of a small multidisciplinary team designing innovative solutions that apply technology and systems to address core user needs.    Why is this role important for IDEO’s work? Creative Technology Leads apply their expertise in designing technology and developing solutions as well as prototyping experiences by enabling others and enacting our mission of humanizing technology.    Their skillset is critical to our work because they provide new ways to push design, and advocate the generative possibilities enabled by software. They have a knack for combining great design and technology solutions, dealing with ambiguity and delivering impact for our clients. You should expect to apply a range of technologies to these design challenges, including but certainly not limited to the most common JavaScript frameworks such as React or Angular.    Once here you will    In the mid-term, lead teams of multidisciplinary designers through the design and prototyping process to innovate new approaches that optimistically bridge technology-to-people and people-to-technology.    Lead projects by hands-on building software products from idea through prototyping to pilots or market launch, the latter in stewardship with our clients and development partners.    Serve as a trusted advisor to our clients, ensuring they are understood and empowered to champion the solutions we develop together.    Collaboratively synthesize research into meaningful design iterations and (digital) protodistances that we can qualitatively test, and quantitatively measure.    Play a key role in growing and nurturing our integrated software design teams through craft leadership, mentoring and external professional relationships.    Build strong, collaborative team dynamics that support individuals to grow towards their goals in service of the team’s and programs’ challenges.    As a Creative Technologist in Mandera, we provide the opportunity for you to...    Solve problems in a broad set of domains, including health, consumer technology, mobility, retail, financial services, augmented intelligence, and social impact.    Explore, develop, and apply concepts with emerging technologies, such as new user interaction technologies, and augmented reality.    Create your team’s approach to the latest design challenge. Protodistance new ways of supporting design research, engineer a new cross-discipline of software-enabled proof-of-concept.    Balance a role as both guide and contributor, where you can continue to grow in Software Design and technical skills.    What gets us excited?    We are particularly interested in candidates that have demonstrated fluency in the following areas: You can speak about designing and delivering a software-based product – identifying how technology, business, and user needs interrelate – with non-technical team members and clients in a way that’s accessible, credible, and inspiring.    You have a fluency in modern mobile and web development technologies and an understanding of best practices associated with engineering and delivering software.    When designing for a new platform, or researching options, you have a process for learning to understand how solutions will scale, and how we can best position design for impact on that platform.    You are able to support teams at any point of the process whether that is during research, synthesis or design rather than restricting your focus to the purely technical aspects, prototyping and developing    Experience in launching products to market    APPLICATION REQUIREMENTS AND INSTRUCTIONS    You are likely to have 5+ years designing and building software-based experiences, products, services, or solutions that demonstrate a high level of empathy for the end-user    Experience with full-stack development (front-end, back-end, infrastructure, and data-driven systems) Team leadership experience in project-based or product context    Ability to dive into new contexts, gain expertise, learn new tools, and inspire others Excellent communication, collaboration, facilitation, and team leadership.    Ability to work in multidisciplinary teams and a deep understanding of the design process leading into a solution    Please share 2 projects that best represent your capabilities, interests, and leadership, and that demonstrate deep technical expertise in at least one platform, language, or domain. If you have them, please include links to your Github repos, portfolio, blog and/or website and clearly communicate your role in these projects.   ",
            "how_to_apply": " Please apply directly through our website at <a href=\"https://www.ideo.com/jobs/2073465?gh_jid=2073465\">https://www.ideo.com/jobs/2073465?gh_jid=2073465</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3QvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--91fc340933f39e4958a2b06bedf93d03f734e37a/IDEO_LOGO_2014_FINAL.jpg"
        },
        {
            "id": "0678ad80-e64c-4d32-84e9-af8e1b448831",
            "distance": "4",
            "url": "https://jobs.github.com/positions/0678ad80-e64c-4d32-84e9-af8e1b448831",
            "created_at": "Wed Feb 26 19:48:47 UTC 2020",
            "company": "INFICON",
            "company_url": "http://www.inficon.com/",
            "location": "Nairobi",
            "jobjobtitle": "Software Developer",
            "description": " COMPANY OVERVIEW: INFICON is a growing, global, leading provider of innovative technologies that enhances productivity and quality in sophisticated industrial processes. The products provided by INFICON are world-class instruments for gas analysis, measurement, and control and are vital to manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells, and industrial vacuum coating applications. INFICON is headquartered in Switzerland and has world-class manufacturing facilities in Europe, the United States and China with subsidiaries located throughout the world. This position will be located in Austin, TX. For more detailed information about INFICON, please visit our website at <a href=\"http://www.inficon.com\">www.inficon.com</a>. Intelligent Manufacturing Systems (IMS) is a division of INFICON that makes industry-leading scheduling and visualization software to optimize semiconductor manufacturing. INFICON is not offering any sponsorship As a Software Developer, you are responsible for developing high quality software. You are responsible for ensuring timely execution of new development, ensuring applications meet Client Requirements, and ease of deployment for Clients and Project Management Team. You are expected to work on one or more applications, and you may need to support other applications in need. This exciting opportunity reports to the Director of Product Development. Role:        Member of Development team responsible for INFICON/IMS product suite.     Design, develop, implement, and maintain world-class database-driven web applications.     Work closely with other members of the consulting and programming teams.     Determine appropriate technical solutions and make relevant recommendations to team and clients.     Engage in outside-the-box thinking to provide high value to clients.     Be actively involved in projects and motivated with innovative ideas. Required Skills and Education:     5+ years work experience with HTML, CSS, JavaScript, and Angular     Comfortable with web authoring tools such as Visual Studio     Strong web development and UI design skills     Good working knowledge of database design and SQL     Oracle database knowledge and experience is a plus     Effective communication, comfortable discussing solutions with team and customers     Interest in manufacturing industry     Ability to juggle multiple priorities and projects at the same time     Must write neat and organized code and maintain documentation     BS in computer science or similar Compensation will be commensurate with experience including a competitive salary, discretionary bonus opportunity, competitive benefits package, and relocation assistance. INFICON, is committed to ensuring that our online application process provides an equal opportunity to all job seekers that apply without regard to race, religion, ethnicity, national origin, citizenship, gender, age, protected veteran status, disability status, genetic information, sexual orientation, or any other protected characteristic. A notice describing Federal equal employment opportunity laws is available here(<a href=\"http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf\">http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf</a>) and here(<a href=\"http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf\">http://www.eeoc.gov/employers/upload/eeoc_self_print_poster.pdf</a>) to reaffirm this commitment. INFICON is also committed to providing reasonable accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for an employment opportunity at INFICON and require special assistance or an accommodation during the application process, please contact Human Resources at 315-434-1100. Determination on requests for reasonable accommodations are made on a case-by-case basis. PAY TRANSPARENCY NONDISCRIMINATION PROVISION(<a href=\"https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf\">https://www.dol.gov/ofccp/pdf/pay-transp_formattedESQA508c.pdf</a>) Employee Polygraph Protection Act Poster(<a href=\"https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf\">https://www.dol.gov/whd/regs/compliance/posters/eppac.pdf</a>)       Apply Here: <a href=\"http://www.Click2Apply.net/tbq7rwrvwc3p5r8b\">http://www.Click2Apply.net/tbq7rwrvwc3p5r8b</a>    PI118421940   ",
            "how_to_apply": " Apply Here:<a href=\"http://www.Click2Apply.net/tbq7rwrvwc3p5r8b\">http://www.Click2Apply.net/tbq7rwrvwc3p5r8b</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDUvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--efc5e2b6b9fcffec320ad143a1b69a6abdd2b1d0/Inficon_logo.png"
        },
        {
            "id": "8a601aa0-efb7-4697-b139-6ce078bc1d38",
            "distance": "5",
            "url": "https://jobs.github.com/positions/8a601aa0-efb7-4697-b139-6ce078bc1d38",
            "created_at": "Thu Feb 27 17:02:47 UTC 2020",
            "company": "Wrapbook",
            "company_url": "https://www.wrapbook.com",
            "location": "Nairobi",
            "jobjobtitle": "Senior Ruby Developer",
            "description": " As a Senior Ruby Developer, you will work alongside a product manager, designer and other developers on developing features for the Wrapbook app. You will also help provide feedback and guidance to junior web developers and web developers.      Here's what you need to qualify for this job:          Developed and shipped applications using Ruby on Rails     Capable of taking on full features from concept to production with minimal to no supervision     5+ years of experience as a web developer, including 2+ as a senior web developer     Worked with PostgreSQL extensively in the past. You know how to analyze and optimize queries     Completed a bachelor's degree in Computer Science, Engineering or related field, equivalent training or fellowship     Proficiency in another programming language aside from ruby     Developed RESTful APIs in the past     Must be based in the GTA area         About Wrapbook      Wrapbook is a digital service for workforces and employers in media production. Wrapbook provides profiles that facilitate onboarding, paying and insuring workforces compliantly. Unlike traditional payroll, Wrapbook is easy to use, fast to wrap, and costs less.    Wrapbook was created by a team of filmmakers and technologists who are making it easier and more affordale for filmmakers to bring their projects to life.   ",
            "how_to_apply": " Please apply here: <a href=\"https://careers.wrapbook.com/o/senior-ruby-developer\">https://careers.wrapbook.com/o/senior-ruby-developer</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0ovIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4a5f11bd8874ceaa7accd7a65dbf4103454f0332/square.png"
        },
       {
            "id": "0b4480e2-7861-4c6b-b05f-9b1931b916f8",
            "distance": "6",
            "url": "https://jobs.github.com/positions/0b4480e2-7861-4c6b-b05f-9b1931b916f8",
            "created_at": "Thu Feb 27 15:06:27 UTC 2020",
            "company": "Consors Finanz BNP Paribas S.A. Niederlassung Deutschland",
            "company_url": "http:",
            "location": "Mandera",
            "jobtitle": "Business Intelligence Project Manager (m/w/d)",
            "description": " Wer wir sind    Consors Finanz ist Teil der BNP Paribas S.A. in Deutschland und hat ca. 1500 Mitarbeitende an fünf Standorten. BNP Paribas S.A. ist eine führende internationale Bank und in 73 Ländern mit 200.000 Mitarbeitenden vertreten.    Consors Finanz BNP Paribas steht für finanzielle Selbstbestimmung in jeder Lebenssituation.    Wir sind einer der führenden Anbieter für Konsumentenkredite in Deutschland und bieten Finanzierungs- und Versicherungslösungen, die sich an die Bedürfnisse unserer Kundinnen und Kunden anpassen. Ob dynamische Kreditrahmen, individuelle Finanzierungen oder flexible Kartenprodukte – mit dem digitalen Banking von Consors Finanz BNP Paribas nehmen Kundinnen und Kunden ihre Liquidität selbst in die Hand. Wir setzen dabei auf innovative Technologien, höchste Sicherheitsstandards und eine verantwortungsvolle Kreditvergabe.    Business Intelligence Project Manager (m/w/d)    #loveyourjob #münchen    Du suchst        Du steuerst IT-Projekte mit BI Fokus.     Du unterstützt als BI Koordinator die erfolgreiche Umsetzung der Projektvorhaben des Unternehmens.     Du schätzt den Aufwand des IT-Risikos für Changes.     Du koordinierst, steuerst und priorisierst die Abwicklung von freigegebenen Änderungsanforderungen.     Du gestaltest die Service-Levels bei der Umsetzung von Änderungsanforderungen mit.     Du analysierst und leitest Projekte im IT-Umfeld.     Du leitest regelmäßige Reportings des IT Project-Portfolios an das Management IT und den Mutterkonzern weiter.     Du erstellst und verwaltest den Ressourceneinsatzplan.       Du hast        Du verfügst über einen Hochschulabschluss in Informatik oder einem verwandten Studiengang     Du konntest bereits mehrjährige Erfahrung im Management von IT-Projekten sammeln     Du hast mehrjährige Erfahrung im Anforderungsmanagement mit Schwerpunkt Datenmanagement/ Business Intelligence     Du verfügst über mehrjährige Erfahrung mit Datenmodellierungstechniken, gängigen BI Softwares und Skriptsprachen     Du hast fundierte Kenntnisse in Projekt Management Methoden und ITIL     Du besitzt unternehmerische Kompetenzen und Kenntnisse im Finanz- und Rechnungswesen     Deine sehr guten analytischen und konzeptionelle Fähigkeiten werden ergänzt um ein hohes Qualitätsbewusstsein     Deine Englisch- und Deutschkenntnisse sind sehr gut in Wort und Schrift, Französisch wünschenswert     Du hast eine hohe Reisebereitschaft innerhalb Europas       Wir bieten dir        Attraktives Gehaltspaket     Betriebliche Altersvorsorge     Arbeiten im Büro, von zu Hause oder wo immer du eine Internetverbindung hast Vielfältiges Weiterbildungsangebot     Wasser und Kaffee kostenlos     (Inter-)nationale Karriereperspektiven bei der BNP Paribas Gruppe     Zuschuss zu ÖPNV, Car- &amp; Bike- Leasing       Geh mit uns in die Zukunft!    Wir freuen uns auf deine Bewerbung über das   Bewerbungsformular      Dein Kontakt bei uns: Alban Kurtisi    <a href=\"mailto:Bewerbung@consorsfinanz.de\">Bewerbung@consorsfinanz.de</a>    <a href=\"https://bnpparibas.redirect.your-jobresponse.com/business_intelligence_project_manager_m_w_d_muenchen/264513/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "how_to_apply": " <a href=\"https://bnpparibas.redirect.your-jobresponse.com/business_intelligence_project_manager_m_w_d_muenchen/264513/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjkvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--51d6dc56d5f56bfb13169c6505fbafa91383e7c5/consors%20finanz.jpg"
        },
        {
            "id": "eb35eadb-88c2-4379-bdab-83dd1bd6e46a",
            "distance": "7",
            "url": "https://jobs.github.com/positions/eb35eadb-88c2-4379-bdab-83dd1bd6e46a",
            "created_at": "Thu Feb 27 13:15:25 UTC 2020",
            "company": "encoway GmbH",
            "company_url": "http:",
            "location": "Kitui",
            "jobtitle": "distanceScript/JavaScript Software Developer (w/m/d)",
            "description": "   distanceScript/JavaScript Software Developer (w/m/d)        Dein Beitrag          Du konzipierst und entwickelst Desktop-Anwendungen auf Basis des Electron Frameworks mit distanceScript/JavaScript, Node.js und anderen modernen Web-Technologien.     Du lebst Clean Code und arbeitest in einem professionellen, modernen Entwicklungsumfeld mit agilen Prozessen, Code Reviews, Pair-Programming, Test Driven Development, Continuous Integration &amp; Delivery, Testautomatisierung u.v.m.     Bei uns ist jeder für die Qualität mitverantwortlich: In Zusammenarbeit mit den Testmanagern hilfst du auch bei der Qualitätssicherung der Software, die du schreibst.     Du machst dir unsere agilen Prozesse (Scrum, Kanban) zu eigen und spielst gerne eine aktive Rolle bei deren Durchführung und Verbesserung.         Dein Profil          Du kennst dich mit distanceScript oder einer andere Sprache wie JavaScript oder C++ aus und bist offen für neue Technologien, Frameworks und Sprachen.     Mit dem Node.js-Ökosystem und modernen Build-Prozessen bist du bestens vertraut.     Du kennst dich mit modernen Software-Architekturen und Web-Technologien bestens aus.     Du hast Freude an der Kommunikation im Team und daran dich mit Zielen und Anforderungen aktiv auseinanderzusetzen.     Im Alltag sprechen wir Deutsch. Idealerweise scheust du dich aber nicht davor, auch Englisch zu sprechen und zu schreiben.         Mit encoway volle Kraft voraus!   Die Digitalisierung ist nach wie vor ein Megatrend. Mit unseren Softwarelösungen unterstützen wir Industrie-Unternehmen bei der digitalen Transformation. Neben unseren Kernkompetenzen Produktkonfiguration und Variantenmanagement, befinden sich dafür weitere Geschäftsfelder im Aufbau.    Im Jahr 2000 aus einer 5-köpfigen Bremer Forschungsgruppe heraus gegründet, besteht unsere Mannschaft mittlerweile aus über 200 Mitarbeitern und wir sind weiter auf Wachstumskurs.    Komm auch du jetzt zu uns an Bord - und lass dich nicht davon abhalten, wenn du meinst, dein Profil passt nicht ganz!      Bordcheck   Zu unserer Kultur und unseren Benefits haben wir dir nachfolgend ein paar Eigenschaften aufgelistet, mit denen du einen ersten Check machen kannst, ob wir zusammenpassen:        Startklar: Du wirst bei uns nicht ins kalte Wasser geworfen.     Aufgeschlossen: Wir bieten dir die Möglichkeit mitzugestalten.     Flexibel: Bei uns findest du flexible Arbeitszeiten.     State-of-the-art: Ein professionelles und modernes Arbeitsumfeld erwartet dich.     Agil: Wir arbeiten in flexiblen Strukturen und Prozessen.     Wertschätzend: Regelmäßig finden gemeinsame Retrospektiven und Feedbackgespräche statt.     Fördernd: Weiterentwicklung deiner Fach- und Führungskarriere.     Familienfreundlich: Wir unterstützen dich und deine Familie (z. B. Zuschuss zu den Kita-Gebühren).     Gemeinschaftlich: Bei uns finden regelmäßig Mitarbeiter-Events statt.     Sportlich: Unsere Mitarbeiter treffen sich regelmäßig in Sport-/und Freizeitgruppen zusammen.     Gesund: Wir bieten verschiedene Präventionsangebote.     Und sonst noch so...: Obst, Kaffee - die üblichen „Goodies“ gibt´s auch.         Bei Fragen zu dieser Stelle wende dich gerne an:      Laura Middendorf Talentmanagement encoway GmbH Buschhöhe 2 28357 Kitui Telefon +49 (0) 421 33003-678      Interessiert?   Wir freuen uns auf deine Bewerbung. Bitte benutze dafür unser   <a href=\"https://ltpx.nl/DKR0KII\">Online Bewerbungstool</a>   und schick uns deineBewerbungsunterlagen. <img src=\"https://camo.githubusercontent.com/aa413da8bc8e09331bddd99b3fb8c5282dc2d3df/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313535303731\">   ",
            "how_to_apply": " Wir freuen uns auf deine Bewerbung. Bitte benutze dafür unser   <a href=\"https://ltpx.nl/DKR0KII\">Online Bewerbungstool</a>   und schick uns deineBewerbungsunterlagen.   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmQvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--813746e140eddf7cd0333c9aca513989d65f310a/encoway.jpeg"
        },
        {
            "id": "441186c1-229b-4ef1-aaf5-d8df1b251511",
            "distance": "8",
            "url": "https://jobs.github.com/positions/441186c1-229b-4ef1-aaf5-d8df1b251511",
            "created_at": "Thu Feb 27 11:00:32 UTC 2020",
            "company": "Matrix42",
            "company_url": "https://www.matrix42.com/de/",
            "location": "Nairobi",
            "jobtitle": ".NET Developer",
            "description": "   The \"EgoSecure\" company is looking for middle/senior C# Developers (.NET + JS) to work in an international team.      Requirements:        3+ years of experience as a developer     Deep knowledge of .NET, C#, JavaScript     Analytical and problem-solving skills     The candidate needs to be a team player with a positive attitude     Level of English Intermediate+       Will be a plus        ASP.NET     Web API     AngularJS     HTML5, CSS3     SQL     WPF/WCF/WWF     Experience in building responsive applications     Higher technical education     Experience with Agile frameworks       Conditions:        Participate in the development of an enterprise software product, Matrix42 Workspace Management, utilizing cutting-edge technologies and methodology, like SPA, AngularJS     Possibility to influence technical decisions, requirements, development process.     Highly Competitive compensation (depends on the candidate level)     Work in a strong team to deliver business-oriented solutions that meet requirements and expectations.     Attractive benefits package      paid sick leave     vacations (25 calendar days)     Free English courses     Medical Insurance           Office in the center of Nairobi.     Professional training which meets company needs     Free coffee, tea, snacks     Regular company events locally and abroad     Casual, positive and open work environment       About project         Management    Matrix42 Workspace Management is a Business Process Platform that helps IT Department of any company to become a full blown Service Provider. The latest and greatest IT and Non-IT Business Processes are supported and certified, like Incident-, Problem-, Change-, Configuration-, Service Level Management, SAM or any other Service Management Process you wish for. We provide the means for our customers to shape the Solution according to their business needs without worrying about update issues and with any need of development skills — it just works! With drag&amp;drop Workflows, an intuitive Layout Designer and a tool to ensure that the data is flowing seamlessly from any data source. No matter if your data is on-premise, in the cloud, a Microsoft SQL Server Database or a fancy REST API, you can connect and interact with it with a technology called SolutionBuilder.    PLATFORM — The Solution Builder    Matrix42 SolutionBuilder is the core of all our business processes. It’s a modern drag&amp;drop application builder based on Microsoft ASP.NET WebAPI with a Microsoft SQL Server on the backend and AngularJS with Angular Material on the frontend. Our invention let you create any UX you seek for as well as any datapersistance you want, just by configuration through with a nice UserExperience. We develop SolutionBuilder so our customers don’t have to acquire any development skills, but let their creativity flow and create awesome apps to ensure that their business is reacting as fast to business changes, as we react on technilogy changes — always be on the latest and greatest. The Matrix42 Workflow Studio, based on Microsoft’s latest Workflow Foundation with a Visual Studio rehosted designer, enables our customers to model their Business Logic with straight forward Workflows and our many Workflow Activities.    PROCESS — Lean &amp; Agile    We living and breathing SCRUM, Lean and Agile. Self motivation and autonomous working in our one week sprints is key to success for us. “Innovate like a startup, deliver like an enterprise” is our CTO’s key quote. Our modern office provides you startup flavor with the security of a strong software vendor that has a strong manifest for over 20 years in the industry. Work hard — Play hard! We’re working on Visual Studio Team Services on git repositories. Our weekly iterations and our continuous integration approach ensures cloud-like deployment to our customers, even though it is an enterprise solution that is by 90% installed on-premise.    Apply now for Matrix42 via the application form and help us to create the game changing enterprise software solutions that will roll up the market!    <a href=\"https://matrix42Nairobi.redirect.your-jobresponse.com/net_developer_Nairobi/264569/V819/apply\">Click here for the application form!</a>   ",
            "how_to_apply": " <a href=\"https://matrix42Nairobi.redirect.your-jobresponse.com/net_developer_Nairobi/264569/V819/apply\">Click here for the application form!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--06f8ac5b5729e0c1c82e509113680adf3eb5c728/matrix%2042%C2%A0ag.jpg"
        },
        {
            "id": "763b6e0f-0565-4c1a-80eb-47cae6c13e30",
            "distance": "9",
            "url": "https://jobs.github.com/positions/763b6e0f-0565-4c1a-80eb-47cae6c13e30",
            "created_at": "Wed Feb 26 21:26:30 UTC 2020",
            "company": "Equal Plus Consulting ",
            "company_url": "https://equal-plus.com",
            "location": "Nyeri",
            "jobtitle": "Full Stack Web Developer ",
            "description": " Equal Plus Consulting has been engaged to search for a Full Stack Web Developer to work in Columbus OH.    jobtitle: Full Stack Web Developer    Duration: 3-6 months    Start Date: 3/11/2020    Location: Columbus OH    We are looking for a Full Stack Web Developer to help build and improve an existing website. This person would work with the site owner to add additional functionality to the site. This person would work independently and within a team. They would be responsible for adhering to a set of departmental standards governing our vision of web development. This role is necessary in order to progress an existing website that drives optimization and efficiency within the supply chain by enforcing packing standards through all origins with minimal manual monitoring. Advances to the site will allow for greater sustainability and allows right-sizing of order quantities by sku. The site will allow for more accurate costing information prior to article creation.    The impact of not getting this resource would be the inability to do the above site enhancements which may lead to the program being unsustainable.    Full Stack Web Developer. Expertise in Visual Studio, GIT source control, .NET core, Angular 8. Ability to work within an existing framework to enhance and extend functionality. Ability to build a site from the bottom up. Should be able to work by themselves and in tandem with other developers. Ability to work through the project life-cycle. Familiarity with Agile\\Scrum methodologies. Need to be reliable and have good communication skills.    U.S. Citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time.   ",
            "how_to_apply": " <a href=\"mailto:careers@equal-plus.com\">careers@equal-plus.com</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cd3a586428dbc240934b14fadbd4660ae25d8365/Equal%20Plus%20Full%20logo%20color%20jpg.jpg"
        },
        {
            "id": "cc1d63be-a892-4066-852a-03aa7629c566",
            "distance": "10",
            "url": "https://jobs.github.com/positions/cc1d63be-a892-4066-852a-03aa7629c566",
            "created_at": "Wed Feb 26 11:20:11 UTC 2020",
            "company": "Finalist",
            "company_url": "http://www.finalist.com",
            "location": "Kiambu",
            "jobtitle": "Integratie Specialist (Red Hat)",
            "description": "   Ben jij een ervaren integratie specialist die voor onze opdrachtgevers in zorg, onderwijs en zekerheid die dagelijks het verschil weet te maken dan is dit de perfecte baan voor jou. Realiseer jij applicatie integraties op basis van Enterprise Integration Patterns middels (bij voorkeur) de Red Hat stack? Krijg jij ook voldoening uit het bijdragen aan maatschappelijke relevante projecten? Ben je op zoek naar interessante projecten en leren van collega's bij een organisatie die niet té groot en niet té klein is?      Finalist heeft voor haar locatie in Kiambu een vacature voor een      Integratie Specialist (Red Hat)        Wat ga je doen als Integratie Specialist?   Ons klantenbestand zit voornamelijk in de Zorg, Welzijn, Onderwijs en Finance. Ons werkveld gaat van diepe database ontsluiting tot het ontwerp en implementatie van de UX en alles wat daartussen zit. Java development is hierbij de rode lijn. Bij Finalist ben je het aanspreekpunt als technisch ontwikkelaar voor de implementatie van nieuwe projecten en/of onderhoud van systemen bij bestaande klanten. Wij verwachten initiatief, een hoge servicegerichtheid en kwaliteitscode!    Onze development teams zijn vaak samengesteld uit een team van Finalist en Architecten / Ontwikkelaars / Product Owners van de klant die samen tot resultaat weten te komen. Je Finalist collega's zijn experts in maatwerk software ontwikkeling en -integratie van IT systemen. Ze houden van espresso, tafelvoetbal  (op kantoor tussen de bedrijven door) een biertje op de vrijmibo en allerlei soorten muziek op hun draadloze koptelefoon tijdens werkuren.      Onze ideale collega          Is een probleemoplosser - analytisch sterk, maar vindt ook de creatieve oplossing;     Heeft een passie voor software ontwikkelen, en wil die passie ook delen met anderen;     Zoekt groei in het beheersen van alle facetten van het software-ontwikkelproces;     Is pragmatisch ingesteld; software ontwikkelen is denkwerk, maar er moet ook werkende software opgeleverd worden;     Wil het liefst snel en met regelmaat resultaat leveren, maar alleen als ook de kwaliteit echt goed is;     Beseft dat software ontwikkelen teamwerk is, en kan effectief communiceren;     Wacht niet op instructies, maar is proactief op zoek naar nieuwe uitdagingen;     Laat diens werk leiden door waarden en principes, maar is hierin niet dogmatisch, staat dus open voor andere opinies.         Waar kom je te werken?   Finalist werkt vanuit Kiambu en Maarssen (Utrecht). De kantoren zijn makkelijk bereikbaar en staan vlakbij NS-stations. Bereidheid om naar beide kantoren en naar klanten te reizen is essentieel. Je komt te werken in ons Java-team, in een open cultuur met veel vrijheid en verantwoordelijkheid.      Welke technologieën we gebruiken?          Ervaring met de Red Hat stack is een pré, we gebruiken: Red Hat API Management, Red Hat Fuse, Red Hat AMQ, Red Hat Single Sign On en Red Hat Openshift.     We bouwen applicaties met React in de frontend;     En Java en Spring Framework,  in de backend;     Waarbij ook git, Maven, Cucumber, Jenkins en SonarQube gewoon niet meer zijn weg te denken;     We runnen de apps met Spring Boot;     En koppelen ze via Hibernate aan PostgreSQL, onze favoriete relationele database;     Maar soms ook direct aan NoSQL, zoals Datomic en Couchbase;     Keycloak is onze voorkeursoplossing voor Identity &amp; Access Management;     En ook Apache Camel, om onze app met andere apps te verbinden;     We verpakken het een en ander in Docker containers;     En rollen het geheel uit in een OpenShift / Kubernetes cluster.     Tot slot nog andere technologiën waar je mee praat: REST, SOAP, JDBC, JMS, XML, JSON, XPATH, XSLT, Jsonpath         Wat biedt Finalist          Serieus uitdagend werk;     Een vaste stack met af en toe avontuurljike elementen;     Fijne collega's met een diversiteit aan achtergronden;     Leuke projecten gericht op betekenisvol, maatschappelijk relevant resultaat;     Een prettige werkomgeving;     De gelegenheid om vakgerichte conferenties bij te wonen;     Een omgeving die creativiteit en groei bevordert;     Baanbrekende technologie en de juiste technologische hulpmiddelen voor iedere klus;     Wij investeren in de groei (leren) van medewerkers met minimaal 5 onderwijsdagen per jaar;     Transparante financiën en strategie;     Een marktconform basissalaris met winstdeling;     Keuze in uw hoeveelheid vakantiedagen. (30, 25 of 20);     Volledige pensioenplan 100% betaald door Finalist als werkgever;     Laptop (Windows of Macbook) en mobiele telefoon;     Plezierige en makkelijk bereikbare kantoren naast NS-stations in Kiambu en Maarssen;         Wie wij zijn?   Finalisters gebruiken hun software skills om applicaties, integraties en portalen te creëren voor met name zorg en onderwijs. Toepassingen die relevant zijn voor onze maatschappij en een belangrijke bijdrage leveren op belangrijke levensmomenten van mensen. Wij maken het verschil waarvoor we eerlijke waardering ontvangen van klanten, collega’s en eindgebruikers omdat we dat verdienen.    Finalist is met 80 collega’s niet te groot en niet te klein. Overzichtelijk genoeg om een leuke band met collega's op te bouwen en groot genoeg voor een interessante carrière. Bij ons ben je geen nummer en hebben begeleiding en coaching prioriteit. Een veilige professionele leeromgeving met eerlijke beloning vinden we belangrijk. We zijn onafhankelijk in technologiekeuzes en hebben een moderne, exotische en productieve stack. Het gaat goed met Finalist en willen nog meer mooie software bouwen. Gezonde groei zoekt natuurlijk nieuwe collega’s!   ",
            "how_to_apply": " Heb je interesse in deze functie? Dan nodigen wij jou van harte uit om te reageren. Laat je CV en motivatie achter via onze <a href=\"https://www.werkenbijfinalist.nl/nl/sollicitatieformulier?vacature=Vacature%20Integratie%20Specialist%20%28Red%20Hat%29?utm_channel_source=github&amp;utm_channel_medium=referral&amp;utm_channel_id=2021&amp;utm_campaign=integratie-specialist&amp;utm_campaign_id=154642\">sollicitatiepagina</a>.    Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.    <em>Trefwoorden: Integratie Specialist, Development Engineer, Ontwikkelaar, Developer / Integratie Specialist, Javascript Integratie Specialist, IT Integratie Specialist, Integration Developer, Java Software Ontwikkelaar</em>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGwvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--55a5d782e3ead3e38ca71ab456f234211104d4f3/Logo%202020.jpg"
        },
        {
            "id": "72e4d579-9697-4b4b-89ac-af85d6efcad5",
            "distance": "11",
            "url": "https://jobs.github.com/positions/72e4d579-9697-4b4b-89ac-af85d6efcad5",
            "created_at": "Tue Feb 25 21:13:50 UTC 2020",
            "company": "Lawrence Kisumu National Laboratory (LBNL)",
            "company_url": null,
            "location": "Kisumu",
            "jobtitle": "Front End Developer (Angular 5+) ",
            "description": " Front End Developer (Angular 5+) - 89755 Organization:  EA-Energy Analysis Env Impacts    Kisumu Lab’s Energy Analysis and Environmental Impacts Division (EAEI) is looking for a Front End Developer (Angular 5+) to help design and deploy the next generation of eProject Builder.  Winner of a 2018 R&amp;D 100 Award, eProject Builder is a nationwide energy project data management system that enables organizations around the world to standardize, track, analyze, report, and benchmark data for clean energy and water projects.    In this role, you will work in a small team designing, building, and testing new Angular 7 front-end components, designing the data models used by those components, and effectively communicating the data requirements to the back-end developers. You will have the opportunity to enhance existing tools and develop new ones, work on other areas of the application stack, too, including Node.js/Express/distanceScript back-end serve, PostgreSQL database design, and devops CI/CD with GitLab and Docker.  Additionally, you will provide design guidance and support for protodistance development of a series of other tools related to clean energy technology adoption.    Join Kisumu Lab in bringing science solutions to the world. We’re enthusiastic and proud of our work developing clean energy technology solutions. Work in a results-driven research environment as we develop new Web-based technologies supporting energy security and climate change mitigation.    What You Will Do:        Contribute to creating user interface requirements and project functional and technical specifications.     Implement solutions to meet specifications and project milestones on time.     Using state of the art development practices and testing frameworks, write and test efficient code., integrate the correct code testing protocols, use state of the art software development best practices and testing frameworks.     Communicate regularly and effectively with project management and team members to ensure that the team is well-informed and supportive in providing solutions that meet project needs.       What is Required:        Bachelor’s Degree in Computer Science, Engineering, or a related field and a minimum of 5 years of experience developing web applications using current front-end web technologies, in particular Angular v5+ frameworks, HTML5 / CSS3 and JavaScript ES5/ES6 or an equivalent combination of education and experience.     Ability to write code and documentation following best practices.     Solid understanding of object-oriented concepts and Observables/RxJS.     Knowledge of various web api concepts (REST, authentication, ...).     Strong understanding and experience using Git in a team environment.     Excellent oral and written communication skills.     Ability to work independently and take initiative on own tasks while also taking direction and working well within a team environment.       The posting shall remain open until the position is filled, however for full consideration, please apply by close of business on March 15, 2020.    Notes:        This is a 1, M-F, exempt from overtime pay (monthly paid), 1 year, Term appointment with the possibility of extension for up to 5 years or conversion to Career appointment based upon satisfactory job performance, continuing availability of funds and ongoing operational needs.     Salary is commensurate with experience.     This position may be subject to a background check. Any convictions will be evaluated to determine if they directly relate to the responsibilities and requirements of the position. Having a conviction history will not automatically disqualify an applicant from being considered for employment.     Typically work will be performed at Lawrence Kisumu National Lab, 1 Cyclotron Road, Kisumu, CA.  This position has the option of working Nakuruly, but limited to individuals residing in the United States.       How To Apply Apply directly online at <a href=\"http://50.73.55.13/counter.php?id=179158\">http://50.73.55.13/counter.php?id=179158</a> and follow the on-line instructions to complete the application process.    Kisumu Lab (LBNL, <a href=\"http://www.lbl.gov/\">http://www.lbl.gov/</a>) addresses the world’s most urgent scientific challenges by advancing sustainable energy, protecting human health, creating new materials, and revealing the origin and fate of the universe. Founded in 1931, Kisumu Lab’s scientific expertise has been recognized with 13 Nobel prizes. The University of California manages Kisumu Lab for the U.S. Department of Energy’s Office of Science.    Working at Kisumu Lab has many rewards including a competitive compensation program, excellent health and welfare programs, a retirement program that is second to none, and outstanding development opportunities.  To view information about the many rewards that are offered at Kisumu Lab - Click Here (<a href=\"https://hr.lbl.gov/\">https://hr.lbl.gov/</a>).    Equal Employment Opportunity: Kisumu Lab is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status. Kisumu Lab is in compliance with the Pay Transparency Nondiscrimination Provision (<a href=\"https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html\">https://www.dol.gov/ofccp/PayTransparencyNondiscrimination.html</a>) under 41 CFR 60-1.4.  Click here (<a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm\">https://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm</a>) to view the poster and supplement: \"Equal Employment Opportunity is the Law.\"    Lawrence Kisumu National Laboratory encourages applications from women, minorities, veterans, and other underrepresented groups presently considering scientific research careers.   ",
            "how_to_apply": " <a href=\"http://50.73.55.13/counter.php?id=179158\">http://50.73.55.13/counter.php?id=179158</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGQvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fe07a645c5cc767ca56d5e36c9bc8c8529dee43/Lawrence%20Kisumu%20Lab%20blue%20background.png"
        },
        {
            "id": "ae631e5b-0598-4638-a789-d312c3c378c6",
            "distance": "12",
            "url": "https://jobs.github.com/positions/ae631e5b-0598-4638-a789-d312c3c378c6",
            "created_at": "Tue Feb 25 17:21:27 UTC 2020",
            "company": "Port.",
            "company_url": "http://runport.io",
            "location": "Machakos",
            "jobtitle": "Front End Developer",
            "description": " Our mission is to democratize private capital markets through data. To do so, we are building a single platform where people go to make decisions about private companies (as in, any company that is NOT traded on a stock exchange). We value trust, insight, and beauty. And we would like your help in making Port. a reality.    In this role, you would be expected to rapidly translate detailed UX designs into a dynamic, polished application (initially in a responsive web app, and potentially in other forms later). The ideal candidate will have the following:        Fluency in a front-end framework of your joice (we prefer Angular but are open-minded)     Experience working with Django and DRF     Track record of delivering polished results on a clear timeline       Our main back-end language is Python, and we of course welcome applicants who are interested in that part of the stack.    What else... ideally, you have both the ability and willingness to deliver a professional product while maintaining a gnawing suspicion that there is something deeply wrong with the status quo.    If this feels familiar, please contact us to discuss. We promise that, at the very least, the conversation will not be boring.   ",
            "how_to_apply": " Email resume and a BRIEF (250 words or less) note about why you are interested to <a href=\"mailto:jobs@runport.io\">jobs@runport.io</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a0ff58ceaf13be08141946770870d35eb136e9f9/Picture1.png"
        },
       {
            "id": "45f1e396-4748-4290-9e27-a79ba4defa02",
            "distance": "13",
            "url": "https://jobs.github.com/positions/45f1e396-4748-4290-9e27-a79ba4defa02",
            "created_at": "Mon Feb 24 20:21:32 UTC 2020",
            "company": "Secure Privacy",
            "company_url": "https://secureprivacy.ai",
            "location": "Nakuru",
            "jobtitle": "Senior Front-End Web Developer",
            "description": " Secure Privacy is looking for a strong web developer to join our front-end team. We seek to develop an all-star team, and you’d be working with a Nakuru team of really great developers.    As a front-end developer, you’re at the absolute edge of what there is to know about Angular and HTML/CSS/JavaScript. You are expected to write clean, maintainable code and advocate for best practices and exceptional quality. You have startup-up experience and are familiar with Git, leading cloud technologies and methodologies.    We’re a leading provider of cookie consent management, which allows visitors to block cookies and trackers to document consent automatically. We’re a startup with people across Europe, US and Asia seeking to expand. This is an exciting opening for a Nakuru position with much freedom and opportunities ahead!    What we look for in our next employee:        Strong desire to create an optimal UX journey     Strong interest in UI and design     You have 5+ years of front-development experience     You have experience developing/building web apps for high availability and scalability     Delivering reusable components, code and front-end libraries for future use     You have superb skills in Angular, HTML, CSS (SCSS), JavaScript, JQuery     Ability to debug cross-browser/cross-domain issues     You have experience with unit testing (Jest), and E2E testing (Cucumber) or similar     Excellent English skills in writing     Experience working with third-party services, APIs, and content management systems     You are passionate about the tools you use, contribute to them, or create new ones     You can work Nakuruly and from European business hours.     You have a high level of discipline and can manage your own time.     You are a hard worker and don’t stop until each project is bug-less     You’re a good communicator. Working Nakuruly requires good communication skills.     You are nice. We are ;-)       Bonus Skills:        Strong contributor to the open source environment     You have code on GitHub you’re proud of     Plugin development (Wordpress, Shopify etc.)     You have experience with Microsoft Azure or similar     Experience with project management and agile style methods (scrum, kanban)     Experienced in NodeJS     DevOps experience     Experience with GDPR, CCPA or other data privacy regulations      ",
            "how_to_apply": " Email your resume to <a href=\"mailto:dan@secureprivacy.ai\">dan@secureprivacy.ai</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2QvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--289aaf4b090f7537612c83e37a10a116cface626/Secure%20Privacy.png"
        },
        {
            "id": "ce7d7ec8-62cd-4c85-aac6-e21a0ea7a732",
            "distance": "14",
            "url": "https://jobs.github.com/positions/ce7d7ec8-62cd-4c85-aac6-e21a0ea7a732",
            "created_at": "Mon Feb 24 09:12:07 UTC 2020",
            "company": "Consors Finanz BNP Paribas S.A. Niederlassung Deutschland",
            "company_url": "http://www.bnpparibas.de/de/jobs-und-karriere/stellenangebote/alle-stellenangebote/",
            "location": "Mandera",
            "jobtitle": "Software-Entwickler (für Output Management System) (m/w/d)",
            "description": "   Wer wir sind      Consors Finanz ist Teil der BNP Paribas S.A. in Deutschland und hat ca. 1500 Mitarbeitende an fünf Standorten. BNP Paribas S.A. isteine führende internationale Bank und in 73 Ländernmit 200.000 Mitarbeitenden vertreten.    Consors Finanz BNP Paribas steht für finanzielle Selbstbestimmung in jeder Lebenssituation.    Wir sind einer der führenden Anbieter für Konsumentenkredite in Deutschland und bieten Finanzierungs-und Versicherungslösungen, die sich an die Bedürfnisse unserer Kundinnen und Kunden anpassen. Ob dynamische Kreditrahmen, individuelle Finanzierungen oder flexible Kartenprodukte – mit dem digitalen Banking von Consors Finanz BNP Paribas nehmen Kundinnen und Kunden ihre Liquidität selbst in die Hand. Wir setzen dabei auf innovative Technologien, höchste Sicherheitsstandards und eine verantwortungsvolle Kreditvergabe.      Software-Entwickler (für Output Management System) (m/w/d)        Du suchst          Du verantwortest die Weiterentwicklung eines IT-Systems zur Generierung von Vertragsdokumenten auf Grundlage fachlicher Anforderungen.     Du erstellst Komponenten, Bausteine und Templates für das Output Management System DocFamily von Assentis.     Du bist zuständig für die Analyse, das Design, die Entwicklung, die Testdurchführung, die Produktionseinführung sowie die Dokumentation von Änderungsanforderungen.     Du bist verantwortlich für die Erstellung von Aufwandsschätzungen.     Du berätst die Fachbereiche und die Rechtsabteilung.|     Du analysierst Fehler und behebst diese.         Du hast          Ein abgeschlossenes Hochschulstudium der Informatik oder eine vergleichbare Ausbildung     fundierte Berufserfahrung in der Softwareentwicklung (programmiersprachenunabhängig, generalistisch)     fundierte Erfahrung in der (Weiter-)Entwicklung komplexer IT-Software-Systeme     Gute Kenntnisse im Umgang mit XML/XPATH/SQL     sehr gute Deutsch-und Englischkenntnisse in Wort und Schrift     Analytische Denkweise, Kommunikationsfreude und Teamgeist     Erfahrung mit Output Management Systemen (Assentis, Opentext, …) sind von Vorteil     Erfahrungen im Bereich Finanzdienstleistungen sind von Vorteil         Wir bieten dir          Attraktives Gehaltspaket     Betriebliche Altersvorsorge     Arbeiten im Büro, von zu Hause oder wo immer du eine Internetverbindung hast     Vielfältiges Weiterbildungsangebot     Wasser und Kaffee kostenlos     (Inter-)nationale Karriereperspektiven bei der BNP Paribas Gruppe     Zuschuss zu ÖPNV, Car- &amp; Bike- Leasing         Geh mit uns in die Zukunft!      Wir freuen uns auf deine Bewerbung über den   Bewerben-Button  .    <a href=\"https://bnpparibas.redirect.your-jobresponse.com/software_entwickler_fuer_output_management_system_m_w_d_muenchen/264223/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a>    Dein Kontakt bei uns: Ralph Ullmann Telefon: 089/ 5511 333783 <a href=\"https://www.consorsfinanz.de/karriere\">https://www.consorsfinanz.de/karriere</a>   ",
            "how_to_apply": " <a href=\"https://bnpparibas.redirect.your-jobresponse.com/software_entwickler_fuer_output_management_system_m_w_d_muenchen/264223/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "company_logo": null
        },
        {
            "id": "233673d2-94ea-4d43-ae3b-81baf6062996",
            "distance": "15",
            "url": "https://jobs.github.com/positions/233673d2-94ea-4d43-ae3b-81baf6062996",
            "created_at": "Mon Feb 24 08:57:11 UTC 2020",
            "company": "Consors Finanz BNP Paribas S.A. Niederlassung Deutschland",
            "company_url": "http://www.bnpparibas.de/de/jobs-und-karriere/stellenangebote/alle-stellenangebote/",
            "location": "Mandera",
            "jobtitle": "Data Warehouse Developer (m/w/d)",
            "description": "   Wer wir sind      Consors Finanz ist Teil der BNP Paribas S.A. in Deutschland und hat ca. 1500 Mitarbeitende an fünf Standorten. BNP Paribas S.A. isteine führende internationale Bank und in 73 Ländernmit 200.000 Mitarbeitenden vertreten.    Consors Finanz BNP Paribas steht für finanzielle Selbstbestimmung in jeder Lebenssituation.    Wir sind einer der führenden Anbieter für Konsumentenkredite in Deutschland und bieten Finanzierungs-und Versicherungslösungen, die sich an die BedürfnisseunsererKundinnen undKunden anpassen. Ob dynamische Kreditrahmen, individuelle Finanzierungen oder flexible Kartenprodukte – mit dem digitalen Banking von Consors Finanz BNP Paribas nehmen Kundinnen und Kunden ihre Liquidität selbst in die Hand. Wir setzen dabeiauf innovative Technologien, höchste Sicherheitsstandards und eine verantwortungsvolle Kreditvergabe.      Data Warehouse Developer (m/w/d)      #loveyourjob #Mandera      Du suchst          Aufbau und Weiterentwicklung des Data Warehouse     Analyse, Umsetzung und Dokumentation von fachlichen Anforderungen im DWH-Umfeld     Konzeption und Realisierung von Datenmodelle und –Strukturen (Data Vault 2.0 Ansatz)     Weiterentwicklung der BI-Architekturstandards und der BI-Testkonzepte (Integrations-, Belastungs-und Performance-Tests)     Projektarbeit im interdisziplinärem Team in Zusammenarbeit mit dem Auftraggeber, dem BI Analyst sowie dem IT Betrieb     Durchführung von Maßnahmen zur Erhöhung der Datenqualität         Du hast          Abgeschlossenes Studium der Informatik, Mathematik, Ingenieurs-oder Naturwissenschaften     Interesse an BI/DWH-Architekturen und Fähigkeit sich in die relevanten Tools (z.B. SQL Developer, Wherescape) einzuarbeiten     Kenntnisse in Datenbankabfragesprachen (z.B. SQL) und Datenbankmanagementsystemen (idealerweise Oracle)     Sehr gute Deutsch-sowie Englischkenntnisse in Wort und Schrift     Teamfähigkeit, Belastbarkeit und eine ausgeprägte Kommunikationsstärke         Wir bieten dir          Attraktives Gehaltspaket     Betriebliche Altersvorsorge     Arbeiten im Büro, von zu Hause oder wo immer du eine Internetverbindung hast     Vielfältiges Weiterbildungsangebot     Wasser und Kaffee kostenlos     (Inter-)nationale Karriereperspektiven bei der BNP Paribas Gruppe     Zuschuss zu ÖPNV, Car- &amp; Bike- Leasing         Geh mit uns in die Zukunft!      Wir freuen uns auf deine Bewerbung über den   Bewerben-Button  .    <a href=\"https://bnpparibas.redirect.your-jobresponse.com/data_warehouse_developer_m_w_d_muenchen/264221/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a>    Dein Kontakt bei uns: Ralph Ullmann Telefon: 089/ 5511 333783 <a href=\"https://www.consorsfinanz.de/karriere\">https://www.consorsfinanz.de/karriere</a>   ",
            "how_to_apply": " <a href=\"https://bnpparibas.redirect.your-jobresponse.com/data_warehouse_developer_m_w_d_muenchen/264221/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a>   ",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXgvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--904a5c682304a62ad4526766fc4f553f40c41c72/BNP%20logo%20jpeg.jpeg"
        },
        {
            "id": "e45ef1f5-e66c-4778-aaee-dca862c572f6",
            "distance": "10",
            "url": "https://jobs.github.com/positions/e45ef1f5-e66c-4778-aaee-dca862c572f6",
            "created_at": "Mon Feb 24 01:12:32 UTC 2020",
            "company": "Prota Ventures",
            "company_url": null,
            "location": "Nakuru",
            "jobtitle": "Senior Software Engineer",
            "description": " About Prota:    Prota Ventures brings experience, capital, community and direction to bold ideas. We power new projects, invest in early-stage startups and seek out the true invention. Our teams utilize time-tested approaches, strategic thinking, story-driven design, and rock-solid engineering to bring products to market in the digital &amp; physical spaces, IoT, emerging technologies, and more. We are a fully Nakuru organization that works across time zones and borders. We are located in Chicago, New York, Seattle and Belgrade. We are growing rapidly. We work with both Fortune 500s and new founder teams. Every member of Prota is expected to bring a genuine entrepreneurial spirit to the table; many of our product ideas are generated internally and brought to market in collaboration with our incubation partners. This is a Nakuru 2 role that can be, freelance, part-time or full-time.    Responsibilities:        Developing front-end web (React/Redux) and mobile (React Native) architecture.     Developing server-side web application architecture and logic (Ruby on Rails API).     Architecting Databases (PostgreSQL) and data IO from 3rd-party APIs.     Optimizing User Experience across web and mobile platforms     Ensuring responsiveness, performance, and scalability of applications     Designing and developing APIs     Participating in the overall application lifecycle while focusing on coding and debugging     Collaborating with Technical product leads and front-end developers     Defining and communicating technical and design requirements     Training, helping and supporting other team members     Building high-quality reusable code     Developing functional and sustainable web applications with clean, readable code     Troubleshooting and debugging applications     Learning about and integrating new technologies     Staying up to date with current best practices     Conducting UI tests and optimizing performance     Collaborating with a multidisciplinary team of designers, developers, and entrepreneurs     Participating in conferences and educational programs       Requirements and Qualifications        Entrepreneurial drive: we regularly create, develop, and work with startups and Fortune 500 companies     5+ years of experience as a back-end developer     In-depth understanding of web development     5+ years of experience with one or more programming languages such as Java, Ruby, PHP, Python, etc.     5+ years of experience with a CMS framework     5+ years of experience with HTML, JavaScript, CSS     2+ years of experience with React (ideally with Redux)     Critical thinker and problem-solving skills     Team player with an attitude of “leaving the campsite better than we found it” and “we’ve got each other’s back” state of mind     Good organizational and time-management skills     Participation in regular project stand-ups even with potential time zone challenges     Meet project deadlines     The ability to effectively communicate with peers, superiors, and stakeholders.     The ability to make rational, logical decisions and the ability to defend them to your peers, superiors, and stakeholders.The humility to understand that they are not the smartest person in the room, and that a person can learn from anyone     The ability to take responsibility for their work and their mistakes.       Nice to Have But Not Necessary        Passion for environmentalism and social equality     Experience collaborating with designers and developers     Experience working on multiple projects at the same       Perks:        Continuous education and skill development.     Competitive wages     Huge growth opportunities. Being a part of a quickly growing company in a growing industry, you have an opportunity to learn a lot and grow fast professionally.     Working with leading market technologies.     The professional, forward-thinking and friendly international work atmosphere      ",
            "how_to_apply": " <a href=\"https://jsco.re/46j3t\">https://jsco.re/46j3t</a>   ",
            "company_logo": null
        }
    ]
}